 Akka_markerData = [

       {
          lat: 32.9667916, lng: 35.120631,
          title: "<h3> أبو سنان / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 33.004889, lng: 35.121111,
          title: "<h3> أم الفرج </h3> ",
       },
       {
          lat: 33.0751, lng: 35.2749,
          title: "<h3> اقرث / إقرت </h3> ",
       },
       {
          lat: 32.9055, lng: 35.1787,
          title: "<h3> البروة </h3> ",
       },
       {
          lat: 33.0781, lng: 35.143,
          title: "<h3> البصة </h3> ",
       },
       {
          lat: 32.9294317, lng: 35.2745164,
          title: "<h3> البعنة / بعنة: من قرى الشاغور / من قرى الجليل </h3> ",
       },
       {
          lat: 32.9767718, lng: 35.3414336,
          title: "<h3> البقيعة / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 33.0074, lng: 35.1372,
          title: "<h3>  التل / تل المفشوخ، تل الميشوح </h3> ",
       },
       {
          lat: 32.9313083, lng: 35.1010214,
          title: "<h3> الجديدة / الجديد، جديدة المكر </h3> ",
       },
       {
          lat: 32.901263, lng: 35.3315578,
          title: "<h3> الحسينية </h3> ",
       },
       {
          lat: 32.8768, lng: 35.1823,
          title: "<h3> الدامون </h3> ",
       },
       {
          lat: 32.9370925, lng: 35.437025,
          title: "<h3>  الرامة / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.8644, lng: 35.1778,
          title: "<h3> الرويس / من قرى الهيجاء </h3> ",
       },
       {
          lat: 33.0479, lng: 35.1014,
          title: "<h3> الزيب </h3> ",
       },
       {
          lat: 32.9723, lng: 35.0927,
          title: "<h3> السميرية </h3> ",
       },
       {
          lat: 33.0002, lng: 35.1496,
          title: "<h3> الغابسية / وادي المجنونة </h3> ",
       },
       {
          lat: 33.0167, lng: 35.1464,
          title: "<h3> الكابري </h3> ",
       },
       {
          lat: 32.9823488, lng: 35.1019088,
          title: "<h3> المزرعة </h3> ",
       },
       {
          lat: 32.9313083, lng: 35.1010214,
          title: "<h3> المكر </h3> ",
       },
       {
          lat: 32.9316, lng: 35.0901,
          title: "<h3> المنشية </h3> ",
       },
       {
          lat: 33.0644, lng: 35.3352,
          title: "<h3> المنصورة </h3> ",
       },
       {
          lat: 33.0798, lng: 35.2897,
          title: "<h3> النبي روبين </h3> ",
       },
       {
          lat: 32.9257792, lng: 35.0157455,
          title: "<h3> النهر </h3> ",
       },
       {
          lat: 32.9658423, lng: 35.4467262,
          title: "<h3> بيت جن / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 33.0158344, lng: 35.2799808,
          title: "<h3> ترشيحا </h3> ",
       },
       {
          lat: 32.9413523, lng: 35.1978341,
          title: "<h3> جولس / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.9005619, lng: 35.1710003,
          title: "<h3> خربة تل البير الغربي </h3> ",
       },
       {
          lat: 32.9173709, lng: 35.0741004,
          title: "<h3> خربة جدين </h3> ",
       },
       {
          lat: 33.0807, lng: 35.2273,
          title: "<h3> خربة عربين / القليطات </h3> ",
       },
       {
          lat: 32.9436557, lng: 35.2853258,
          title: "<h3> دير الأسد: من قرى الشاغور / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 33.0346, lng: 35.3233,
          title: "<h3> دير القاسي / الآسي </h3> ",
       },
       {
          lat: 32.8641372, lng: 35.402673,
          title: "<h3> دير حنا / حنه: إحدى قرى يوم الأرض الثلاثة </h3> ",
       },
       {
          lat: 32.916861111111, lng: 35.372819444444,
          title: "<h3> راس العين، رأس العين </h3> ",
       },
       {
          lat: 32.9392349, lng: 35.3220784,
          title: "<h3> ساجور / سجور / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 33.0058, lng: 35.3024,
          title: "<h3> سحماتا </h3> ",
       },
       {
          lat: 32.8593191, lng: 35.3442999,
          title: "<h3> سخنين : إحدى قرى يوم الأرض الثلاثة ، وهي مدينة الآن </h3> ",
       },
       {
          lat: 33.0846, lng: 35.2914,
          title: "<h3> سروح / صروح </h3> ",
       },
       {
          lat: 32.8931386, lng: 35.2582345,
          title: "<h3> شعب </h3> ",
       },
       {
          lat: 32.850267, lng: 35.2472612,
          title: "<h3> طمرة / تمرة </h3> ",
       },
       {
          lat: 32.8556483, lng: 35.3579112,
          title: "<h3> عرابة / عرابة البطوف / مدينة حالية: إحدى قرى يوم الأرض الثلاثلة، مدينة  الطب </h3> ",
       },
       {
          lat: 32.9781, lng: 35.1669,
          title: "<h3> عمقا </h3> ",
       },
       {
          lat: 33.0527522, lng: 35.341763,
          title: "<h3> فسوطة / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 35.2218032, lng: 32.8766473,
          title: "<h3> كابول </h3> ",
       },
       {
          lat: 33.0268211, lng: 35.258061,
          title: "<h3> معليا / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.9706, lng: 35.147,
          title: "<h3> كويكات </h3> ",
       },
       {
          lat: 32.8753, lng: 35.246,
          title: "<h3> ميعار / معار </h3> ",
       },
       {
          lat: 32.9716951, lng: 35.330421,
          title: "<h3> كفر سميع / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.978616, lng: 35.2798345,
          title: "<h3> يانوح / جث / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.9156594, lng: 35.2993872,
          title: "<h3> مجد الكروم : من قرى الشاغور / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.9351153, lng: 35.3344662,
          title: "<h3> نحف / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.9600596, lng: 35.2458785,
          title: "<h3> يركة / يركا / كفر يركا / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.9227, lng: 35.4182,
          title: "<h3> كفر عنان </h3> ",
       },
       {
          lat: 32.954722222222, lng: 35.165277777778,
          title: "<h3> كفر ياسيف / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.8733026, lng: 35.380542,
          title: "<h3> المغار / الرملة </h3> ",
       },
       {
          lat: 32.93925, lng: 35.36711,
          title: "<h3> الرامة / جنين </h3> ",
       },















	//Missing places in pdf
/*
       {
          lat: 32.9096655, lng: 35.3625115,
          title: "<h3> وادي سلامة </h3> ",
       },
       {
          lat: 32.9096655, lng: 35.3625115,
          title: "<h3> الكمانة </h3> ",
       },
       {
          lat: 33.041145, lng: 35.148471,
          title: "<h3> المنوات </h3> ",
       },
       {
          lat: 33.0826, lng: 35.2845,
          title: "<h3> تربيخا- طربيخا/ من القرى السبع </h3> ",
       },
       {
          lat: 32.9403078, lng: 35.419176,
          title: "<h3> عين الأسد </h3> ",
       },
       {
          lat: 33.0873179, lng: 35.1792098,
          title: "<h3> حانوتا / حنيتا </h3> ",
       },
       {
          lat: 33.0888627, lng: 35.23391,
          title: "<h3> عرب العرامشة </h3> ",
       },
       {
          lat: 33.012425, lng: 35.1959957,
          title: "<h3> واد جعتون / الجعتون </h3> ",
       },
*/
     

   ];







for (let i = 0; i < Akka_markerData.length; i++) {
    let AkkamarkerTitle = Akka_markerData[i].title;

    AkkamarkerTitle = `<div style="max-width: 400px; padding: 0px; text-align: right;">${AkkamarkerTitle}</div>`;
    AkkamarkerTitle = AkkamarkerTitle.replace(/<p>(.*?)<\/p>/g, '<p style="font-size: 16px; margin-top: -8px; margin-bottom: 5px; text-indent: 28px; direction:rtl">$1</p>');
    AkkamarkerTitle = AkkamarkerTitle.replace(/<b>(.*?)<\/b>/g, '<b style="font-size: 15px; font-wight: bold;">$1</b>');
  

    Akka_markerData[i].title = AkkamarkerTitle;
}