 Gaza_markerData = [

       {
          lat: 31.6286, lng: 34.5971,
          title: "<h3> الجية </h3> ",
       },
       {
          lat: 31.7135, lng: 34.7036,
          title: "<h3> السوافير الشَمَالْية </h3> ",
       },
       {
          lat: 31.2813586, lng: 34.372798,
          title: "<h3> الفَخَارِيْ/ الفَوَاخْرِي- محافظة خان يونس </h3> ",
       },
       {
          lat: 31.547966, lng: 34.610968,
          title: "<h3> المنصورة </h3> ",
       },
       {
          lat: 31.4218244, lng: 34.3957158,
          title: "<h3> المَغَازِي/ دَاثِنْ- المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.2656595, lng: 34.2918593,
          title: "<h3> النصر / البْيُوكْ- محافظة رَفَحْ </h3> ",
       },
       {
          lat: 31.6611, lng: 34.7053,
          title: "<h3> بيت عفا </h3> ",
       },
       {
          lat: 31.7229, lng: 34.6832,
          title: "<h3> بيت دراس </h3> ",
       },
       {
          lat: 31.5707, lng: 34.6407,
          title: "<h3> برير </h3> ",
       },
       {
          lat: 31.454580, lng: 34.438358,
          title: "<h3> جحر الديك - محافظة غزة </h3> ",
       },
       {
          lat: 31.6918, lng: 34.5908,
          title: "<h3> حمامة </h3> ",
       },
       {
          lat: 31.306007, lng: 34.359031,
          title: "<h3> خزاعة - محافظة خَانْ يُونُسْ </h3> ",
       },
       {
          lat: 31.5582, lng: 34.5663,
          title: "<h3> دمرة </h3> ",
       },
       {
          lat: 34.343865, lng: 31.340412,
          title: "<h3> عَبَسَان الجديدة/ الصغيرة - محافظة خَانْ يُونِسْ </h3> ",
       },
       {
          lat: 31.6772, lng: 34.6985,
          title: "<h3> عِبدِس </h3> ",
       },
       {
          lat: 31.5017125, lng: 34.4771443,
          title: "<h3> غزة - محافظة غَزَّة </h3> ",
       },
       {
          lat: 31.4388034, lng: 34.4126898,
          title: "<h3> مُخَيِّمْ/مُعَسّكَر  البُرَيْج- المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.5387851, lng: 34.5053863,
          title: "<h3> مُخَيِّمْ/مُعَسّكَر جَبَالْيا- محافظة الشمال </h3> ",
       },
       {
          lat: 31.5524, lng: 34.596,
          title: "<h3> نجد </h3> ",
       },
       {
          lat: 31.396720, lng: 34.360746,
          title: "<h3> وادِي السَلْقَا- المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.5595511, lng: 34.5340399,
          title: "<h3> أم النصر / القرية البَدَويَّة- محافظة الشمال </h3> ",
       },
       {
          lat: 31.4388034, lng: 34.4126898,
          title: "<h3> البريج / خِربَة البُرَيْج- المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.4724504, lng: 34.4087288,
          title: "<h3> الزهراء - محافظة غَزَّة </h3> ",
       },
       {
          lat: 31.6992, lng: 34.7032,
          title: "<h3> السوافير الغربية </h3> ",
       },
       {
          lat: 31.3713111, lng: 34.3455383,
          title: "<h3> القَرّارَة- محافظة خَانْ يُونُسْ </h3> ",
       },
       {
          lat: 31.6677059, lng: 34.6346942,
          title: "<h3> المَجْدَل/ المَجْدَل عَسْقَلان </h3> ",
       },
       {
          lat: 31.4659, lng: 34.6104,
          title: "<h3> المحرقة </h3> ",
       },
       {
          lat: 31.5339031, lng: 34.4924963,
          title: "<h3> النزلة / نَّزْلَة جَبَالْيا - محافظة الشمال </h3> ",
       },
       {
          lat: 31.6242, lng: 34.5792,
          title: "<h3> بربرة </h3> ",
       },
       {
          lat: 31.6234, lng: 34.638,
          title: "<h3> بَيتْ طِيْمَا </h3> ",
       },
       {
          lat: 31.6884, lng: 34.818,
          title: "<h3> بعلين </h3> ",
       },
       {
          lat: 31.6581, lng: 34.7717,
          title: "<h3> جسير </h3> ",
       },
       {
          lat: 31.6, lng: 34.6487,
          title: "<h3> حليقات </h3> ",
       },
       {
          lat: 31.2967791, lng: 34.2537603,
          title: "<h3> رفح </h3> ",
       },
       {
          lat: 31.322302, lng: 34.342432,
          title: "<h3> عبسان الكبير - محافظة خاَنْ يُونِسْ </h3> ",
       },
       {
          lat: 31.6067, lng: 34.784,
          title: "<h3> عراق المنشية / جِتْ الكنعانية </h3> ",
       },
       {
          lat: 31.6423, lng: 34.7255,
          title: "<h3> كرتيا </h3> ",
       },
       {
          lat: 31.5373911, lng: 34.4639473,
          title: "<h3> مُخَيِّمْ/مُعَسّكَر الشّاطِئ- محافظة غَزَّة </h3> ",
       },
       {
          lat: 31.3487771, lng: 34.3031552,
          title: "<h3> مُخَيِّمْ/مُعَسّكَر خَانْ يُونُسْ- محافظة خَانْ يُونُسْ </h3> ",
       },
       {
          lat: 31.646, lng: 34.5717,
          title: "<h3> نعليا </h3> ",
       },
       {
          lat: 31.7656, lng: 34.7476,
          title: "<h3> ياصور / يَاسُوْر </h3> ",
       },
       {
          lat: 31.7553, lng: 34.6602,
          title: "<h3> إسدود </h3> ",
       },
       {
          lat: 31.6923, lng: 34.7499,
          title: "<h3> الجلدية </h3> ",
       },
       {
          lat: 31.428552, lng: 34.367825,
          title: "<h3> الزوايدة - محافظة الوُسْطَى </h3> ",
       },
       {
          lat: 31.2560921, lng: 34.3340853,
          title: "<h3> الشَوّكَة/ شَوّكَة الصُوفَي- محافظة رَفَحْ </h3> ",
       },
       {
          lat: 31.751446, lng: 34.790906,
          title: "<h3> القسطينة / قُسْطِيْنِة </h3> ",
       },
       {
          lat: 31.7525, lng: 34.7986,
          title: "<h3> المسمية الصغيرة / مسْمِّية الحوراني / الحورانية </h3> ",
       },
       {
          lat: 34.371069, lng: 31.414900,
          title: "<h3> المصدر - المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.4499844, lng: 34.4032088,
          title: "<h3> النُصَيْرَاتْ- المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.7761, lng: 34.6996,
          title: "<h3> برقة </h3> ",
       },
       {
          lat: 31.6028, lng: 34.5808,
          title: "<h3> بيت جرْجَا </h3> ",
       },
       {
          lat: 31.7253, lng: 34.7725,
          title: "<h3> تل الترمس </h3> ",
       },
       {
          lat: 31.6811, lng: 34.6534,
          title: "<h3> جولس - غزة </h3> ",
       },
       {
          lat: 31.6481, lng: 34.5611,
          title: "<h3> خربة الخصاص / الخِصَاص- غزة </h3> ",
       },
       {
          lat: 31.4171385, lng: 34.350931,
          title: "<h3> دير البلح / المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.567, lng: 34.6065,
          title: "<h3> سِمْسِم </h3> ",
       },
       {
          lat: 31.8254, lng: 34.6569,
          title: "<h3> عَرَبْ صُقْريِر- سُكرير / عرب أبو سُوَيْرِح </h3> ",
       },
       {
          lat: 31.647, lng: 34.6935,
          title: "<h3> عراق سويدان </h3> ",
       },
       {
          lat: 31.4777, lng: 34.6602,
          title: "<h3> كَوْفَخة </h3> ",
       },
       {
          lat: 31.5037026, lng: 34.4298417,
          title: "<h3> مجزرة دَوّار النَابلْسِي </h3> ",
       },
       {
          lat: 31.4218244, lng: 34.3957158,
          title: "<h3> مُخَيِّمْ/مُعَسّكَر المَغَازِي- المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.4266202, lng: 34.3454305,
          title: "<h3> مُخَيِّمْ/مُعَسّكَر دِير البَلَحْ- المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.5103, lng: 34.6219,
          title: "<h3> هوج </h3> ",
       },
       {
          lat: 31.7516, lng: 34.7223,
          title: "<h3> البطاني الشرقي </h3> ",
       },
       {
          lat: 31.6659, lng: 34.5545,
          title: "<h3> الجورة / جُورَة عَسْقَلان </h3> ",
       },
       {
          lat: 31.7001, lng: 34.7126,
          title: "<h3> السوافير الشرقية </h3> ",
       },
       {
          lat: 31.627473, lng: 34.749632,
          title: "<h3> الفالوجة / الفَالُوجَا </h3> ",
       },
       {
          lat: 31.4171564, lng: 34.3612308,
          title: "<h3> المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.7572, lng: 34.7841,
          title: "<h3> المسمية الكبيرة </h3> ",
       },
       {
          lat: 31.467950, lng: 34.413165,
          title: "<h3> المُغْراقَة- محافظة غَزَّة </h3> ",
       },
       {
          lat: 31.341663, lng: 34.325494,
          title: "<h3> بني سُهَيْلَا- محافظة محافظة خَانْ يُونُسْ </h3> ",
       },
       {
          lat: 31.5384825, lng: 34.53677,
          title: "<h3> بيت حانون - محافظة الشمال </h3> ",
       },
       {
          lat: 31.568157, lng: 34.495676,
          title: "<h3> بيت لاهيا - محافظة الشمال </h3> ",
       },
       {
          lat: 31.5294134, lng: 34.4694413,
          title: "<h3> جباليا - محافظة الشمال </h3> ",
       },
       {
          lat: 31.6511, lng: 34.74,
          title: "<h3> حتا </h3> ",
       },
       {
          lat: 31.3461996, lng: 34.3142769,
          title: "<h3> خان يونس </h3> ",
       },
       {
          lat: 31.5743, lng: 34.5543,
          title: "<h3> دير سنيد </h3> ",
       },
       {
          lat: 31.6648, lng: 34.7941,
          title: "<h3> صميل </h3> ",
       },
       {
          lat: 31.6677059, lng: 34.6346942,
          title: "<h3> عَسْقَلان </h3> ",
       },
       {
          lat: 31.5472487, lng: 34.5614979,
          title: "<h3> عِزْبَة بيت حانون- محافظة الشمال </h3> ",
       },
       {
          lat: 31.6301, lng: 34.6611,
          title: "<h3> كوكبا </h3> ",
       },
       {
          lat: 31.4499844, lng: 34.4032088,
          title: "<h3> مُخَيِّمْ/مُعَسّكَر النُصَيْرَاتْ- المحافظة الوسطى </h3> ",
       },
       {
          lat: 31.3007585, lng: 34.2598115,
          title: "<h3> مُخَيِّمْ/مُعَسّكَر رَفَحْ- محافظة رَفَحْ </h3> ",
       },
       {
          lat: 31.6058, lng: 34.5459,
          title: "<h3> هربيا </h3> ",
       },
       
     

   ];







for (let i = 0; i < Gaza_markerData.length; i++) {
    let GazamarkerTitle = Gaza_markerData[i].title;

    GazamarkerTitle = `<div style="max-width: 400px; padding: 0px; text-align: right;">${GazamarkerTitle}</div>`;
    GazamarkerTitle = GazamarkerTitle.replace(/<p>(.*?)<\/p>/g, '<p style="font-size: 16px; margin-top: -8px; margin-bottom: 5px; text-indent: 28px; direction:rtl">$1</p>');
    GazamarkerTitle = GazamarkerTitle.replace(/<b>(.*?)<\/b>/g, '<b style="font-size: 15px; font-wight: bold;">$1</b>');
  

    Gaza_markerData[i].title = GazamarkerTitle;
}