 Haifa_markerData = [

       {
          lat: 32.6326, lng: 35.1252,
          title: "<h3> أبو زريق / قرى الروحة </h3> ",
       },
       {
          lat: 32.6476, lng: 35.0638,
          title: "<h3> أم الزينات / قرى الروحة </h3> ",
       },
       {
          lat: 32.827896, lng: 35.174408,
          title: "<h3> إعبلين / عْبِِلَّيْن </h3> ",
       },
       {
          lat: 32.534819, lng: 34.947486,
          title: "<h3> الشُوّنَة / قرى الروحة </h3> ",
       },
       {
          lat: 32.601389, lng: 35.151389,
          title: "<h3> الغُبية الفوقا / قرى الروحة </h3> ",
       },
       {
          lat: 32.573694, lng: 35.1185,
          title: "<h3> الكفرين / قرى الروحة </h3> ",
       },
       {
          lat: 32.6512, lng: 34.9614,
          title: "<h3> جبع </h3> ",
       },
       {
          lat: 32.793333, lng: 35.138556,
          title: "<h3> خربة الكسابر </h3> ",
       },
       {
          lat: 32.591153, lng: 35.078056,
          title: "<h3> دالية الروحاء / قرى الروحة </h3> ",
       },
       {
          lat: 32.458583, lng: 34.906611,
          title: "<h3> عرب الضميري </h3> ",
       },
       {
          lat: 32.499522, lng: 35.090374,
          title: "<h3> عرعرة </h3> ",
       },
       {
          lat: 32.717172, lng: 35.065138,
          title: "<h3> عسفيا / قرى الروحة </h3> ",
       },
       {
          lat: 32.54875, lng: 34.920667,
          title: "<h3> كبارة </h3> ",
       },
       {
          lat: 32.6373536, lng: 34.9323452,
          title: "<h3> كفر لام </h3> ",
       },
       {
          lat: 32.7925, lng: 35.143611,
          title: "<h3> هوشة </h3> ",
       },
       {
          lat: 32.6144, lng: 35.1377,
          title: "<h3> أبو شوشة / قرى الروحة </h3> ",
       },
       {
          lat: 32.554, lng: 35.0486,
          title: "<h3> أم الشوف / قرى الروحة </h3> ",
       },
       {
          lat: 32.5347639, lng: 35.1924239,
          title: "<h3> أم الفحم / ألحقت بقرى حيفا منذ 1949 </h3> ",
       },
       {
          lat: 32.553333, lng: 35.093889,
          title: "<h3> البطيمات / قرى الروحة </h3> ",
       },
       {
          lat: 32.5576, lng: 34.9991,
          title: "<h3> السنديانة / قرى الروحة </h3> ",
       },
       {
          lat: 32.647, lng: 34.9352,
          title: "<h3> الصرفند / صرفند </h3> ",
       },
       {
          lat: 32.599325, lng: 34.95145,
          title: "<h3> الفريديس / قرى الروحة </h3> ",
       },
       {
          lat: 32.682222, lng: 34.964444,
          title: "<h3> المزار </h3> ",
       },
       {
          lat: 32.509347, lng: 34.916569,
          title: "<h3> برة قيسارية </h3> ",
       },
       {
          lat: 32.558056, lng: 34.975556,
          title: "<h3> بريكة / السِنْدِيَانَات / قرى الروحة </h3> ",
       },
       {
          lat: 32.732778, lng: 35.022222,
          title: "<h3> خربة الدامون </h3> ",
       },
       {
          lat: 32.801283, lng: 35.213708,
          title: "<h3> شفا عمرو </h3> ",
       },
       {
          lat: 32.5230368, lng: 35.3313344,
          title: "<h3> صندلة / ألحقت بقرى حيفا عام 1949 </h3> ",
       },
       {
          lat: 32.452222, lng: 34.905833,
          title: "<h3> عرب الفقراء / الشيخ حلو </h3> ",
       },
       {
          lat: 32.7015, lng: 34.9802,
          title: "<h3> عين حوض / من قرى الهيجاء </h3> ",
       },
       {
          lat: 32.529, lng: 35.030,
          title: "<h3> قنير / قرى الروحة </h3> ",
       },
       {
          lat: 32.476384, lng: 34.974056,
          title: "<h3> وادي عارة </h3> ",
       },
       {
          lat: 32.723403, lng: 35.088478,
          title: "<h3> الجلمة </h3> ",
       },
       {
          lat: 32.6094, lng: 34.9174,
          title: "<h3> الطنطورة </h3> ",
       },
       {
          lat: 32.4191064, lng: 35.070809,
          title: "<h3> باقة الغربية / مدينة حالية </h3> ",
       },
       {
          lat: 32.645458, lng: 34.964361,
          title: "<h3> خربة المنارة </h3> ",
       },
       {
          lat: 32.7741, lng: 35.1304,
          title: "<h3> خربة سعسع </h3> ",
       },
       {
          lat: 32.556111, lng: 35.065556,
          title: "<h3> خبيزة / قرى الروحة </h3> ",
       },
       {
          lat: 32.7623, lng: 34.9744,
          title: "<h3> طيرة حيفا / طيرة الكرمل / طيرة اللوز/ الطيرة </h3> ",
       },
       {
          lat: 32.6324, lng: 34.9671,
          title: "<h3> عين غزال </h3> ",
       },
       {
          lat: 32.498, lng: 34.9216,
          title: "<h3> قيسارية </h3> ",
       },
       {
          lat: 32.814806, lng: 35.118806,
          title: "<h3> وعرة السريس </h3> ",
       },
       {
          lat: 32.7290324, lng: 35.1745961,
          title: "<h3> أم العمد </h3> ",
       },
       {
          lat: 32.6446, lng: 34.9882,
          title: "<h3> إجزم / قرى الروحة </h3> ",
       },
       {
          lat: 32.7724, lng: 35.0422,
          title: "<h3> بلد الشيخ </h3> ",
       },
       {
          lat: 32.4465, lng: 34.9596,
          title: "<h3> خربة الشركس / السركس </h3> ",
       },
       {
          lat: 32.674347, lng: 35.099708,
          title: "<h3> خربة المنصورة </h3> ",
       },
       {
          lat: 32.558111, lng: 34.977639,
          title: "<h3> خربة قمبازة </h3> ",
       },
       {
          lat: 32.5716, lng: 35.0223,
          title: "<h3> صبارين / قرى الروحة </h3> ",
       },
       {
          lat: 32.6934, lng: 34.9374,
          title: "<h3> عتليت </h3> ",
       },
       {
          lat: 32.423056, lng: 34.881667,
          title: "<h3> عرب النفيعات </h3> ",
       },
       {
          lat: 32.5052851, lng: 35.0121125,
          title: "<h3> كفر قرع / قرى الروحة </h3> ",
       },
       {
          lat: 32.5456819, lng: 35.173485,
          title: "<h3> مُصمُصْ / ألحقت بقرى حيفا منذ 1949/ قرى الروحة </h3> ",
       },
       {
          lat: 32.4306, lng: 35.0361,
          title: "<h3> جت / جِتْ المثلث / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.5750, lng: 35.1808,
          title: "<h3> كسرا / كيسرا / كسرى / من قرى الجليل الأعلى </h3> ",
       },
       {
          lat: 32.7719584, lng: 35.1518106,
          title: "<h3> أبو الفضل / السطري / عرب أبو الفضل </h3> ",
       },




	//Missing places in pdf
/*
       {
          lat: 32.4666352, lng: 35.0466752,
          title: "<h3> أم القطف / أم القطوف </h3> ",
       },
       {
          lat: 32.603389, lng: 35.157472,
          title: "<h3> النَغْنَغِيَّة / قرى الروحة </h3> ",
       },
       {
          lat: 32.5564193, lng: 35.2026399,
          title: "<h3> بَيَّاضَة/ ألحقت بقرى حيفا عام 1949/ قرى الروحة </h3> ",
       },
       {
          lat: 32.6138, lng: 35.2229,
          title: "<h3> خربة لد / خربة العوادين </h3> ",
       },
       {
          lat: 32.5446912, lng: 35.2088988,
          title: "<h3> سَالِمْ / ألحقت بقرى حيفا منذ 1949 </h3> ",
       },
       {
          lat: 32.5262952, lng: 34.9293145,
          title: "<h3> صَفَصَافا/ قرى الروحة </h3> ",
       },
       {
          lat: 32.4474382, lng: 35.0528649,
          title: "<h3> ميسر/ خربة الشيخ ميسر/ بئر الحمام/ كانت تتبع طولكرم </h3> ",
       },
       {
          lat: 32.53792, lng: 34.91223,
          title: "<h3> جسر الزرقاء </h3> ",
       },
       {
          lat: 32.749444, lng: 35.183611,
          title: "<h3> حجاجرة </h3> ",
       },
       {
          lat: 32.6384, lng: 35.0086,
          title: "<h3> خربة الماقورة </h3> ",
       },
       {
          lat: 32.77949, lng: 35.1512523,
          title: "<h3> خربة رأس علي </h3> ",
       },
       {
          lat: 32.770833, lng: 35.136667,
          title: "<h3> خوالد </h3> ",
       },
       {
          lat: 32.6959852, lng: 35.0159845,
          title: "<h3> دالية الكرمل </h3> ",
       },
       {
          lat: 32.472403, lng: 34.975629,
          title: "<h3> كركور </h3> ",
       },
       {
          lat: 32.8, lng: 35.1,
          title: "<h3> كفريتا / كفرتيا / كفرتا </h3> ",
       },
       {
          lat: 32.5528955, lng: 35.1687109,
          title: "<h3> مُشَيْرِفَة / ألحقت بقرى حيفا عام 1949 / قرى الروحة </h3> ",
       },
       {
          lat: 32.7628056, lng: 35.1019757,
          title: "<h3> إبطن </h3> ",
       },
       {
          lat: 32.805670, lng: 35.058065,
          title: "<h3> الدار البيضاء </h3> ",
       },
       {
          lat: 32.8069, lng: 34.970911,
          title: "<h3> الكبابير </h3> ",
       },
       {
          lat: 32.5176836, lng: 35.0086581,
          title: "<h3> المَرَاحْ/ قرى الروحة </h3> ",
       },
       {
          lat: 32.4755012, lng: 35.1022728,
          title: "<h3> بَرْطَعَة الغَرْبِيَّة </h3> ",
       },
       {
          lat: 32.7724, lng: 35.0422,
          title: "<h3> تجمع حَوَّاسَة/ بلد الشيخ </h3> ",
       },
       {
          lat: 32.6725, lng: 35.023333,
          title: "<h3> جعارة/ قرى الروحة </h3> ",
       },
       {
          lat: 32.7898603, lng: 35.0276099,
          title: "<h3> حي التَنَّك/ بوابة فقراء عكا </h3> ",
       },
       {
          lat: 32.6324, lng: 34.9671,
          title: "<h3> خربة السوامر / السوامير/ تتبع قرية عين غزال </h3> ",
       },
       {
          lat: 32.5500053, lng: 35.2204059,
          title: "<h3> زَلْفَة / ألحقت بقرى حيفا عام 1949 </h3> ",
       },
       {
          lat: 32.6098863, lng: 35.0164334,
          title: "<h3> شفيَّا/ قرى الروحة </h3> ",
       },
       {
          lat: 32.7588595, lng: 35.184205,
          title: "<h3> كعبية </h3> ",
       },
       {
          lat: 32.7996878, lng: 35.0579759,
          title: "<h3> مذبحة الريفاينري/ مذبحة مصفاة حيفا </h3> ",
       },
       {
          lat: 32.5319602, lng: 35.1131528,
          title: "<h3> مُعَاوِيّة/ ألحقت بقرى حيفا عام 1949/ قرى الروحة </h3> ",
       },
       {
          lat: 32.5652836, lng: 35.000381,
          title: "<h3> أم الدفوف/ قرى الروحة </h3> ",
       },
       {
          lat: 32.6199, lng: 35.086,
          title: "<h3> الرِّيحَانِيَّة/ قرى الروحة </h3> ",
       },
       {
          lat: 32.6751592, lng: 34.9296543,
          title: "<h3> الشيخ بريك، إبريك، إبريق </h3> ",
       },
       {
          lat: 32.6075, lng: 35.143889,
          title: "<h3> الغُبَيَة التَحْتَا / قرى الروحة </h3> ",
       },
       {
          lat: 32.5945, lng: 35.1725,
          title: "<h3> المَنْسي/ عرب بنيها/ قرى الروحة </h3> ",
       },
       {
          lat: 32.740278, lng: 35.156944,
          title: "<h3> بسمة طبعون </h3> ",
       },
       {
          lat: 32.6953113, lng: 35.158484,
          title: "<h3> تل الشمام/ خربة دبّاشَة </h3> ",
       },
       {
          lat: 32.703333, lng: 35.165,
          title: "<h3> جيدا </h3> ",
       },
       {
          lat: 32.509542, lng: 34.940611,
          title: "<h3> خربة البُرْج/ قرى الروحة </h3> ",
       },
       {
          lat: 32.4817948, lng: 35.0208704,
          title: "<h3> دار الحنون </h3> ",
       },
       {
          lat: 32.570833, lng: 34.951667,
          title: "<h3> زَمَّاريّن/ قرى الروحة </h3> ",
       },
       {
          lat: 32.505692, lng: 35.078122,
          title: "<h3> عَارَة/ قرى الروحة/ من قرى المثلث الشمالي </h3> ",
       },
       {
          lat: 32.645, lng: 35.1025,
          title: "<h3> قِيّرَة وقَامُونْ/ قرى الروحة </h3> ",
       },
       {
          lat: 32.7056884, lng: 35.1893657,
          title: "<h3> منشية زبدة / السعدية </h3> ",
       },
       {
          lat: 32.7586, lng: 35.0569,
          title: "<h3> يَاجُور </h3> ",
       },

*/
          
   ];


for (let i = 0; i < Haifa_markerData.length; i++) {
    let HaifamarkerTitle = Haifa_markerData[i].title;

    HaifamarkerTitle = `<div style="max-width: 400px; padding: 0px; text-align: right;">${HaifamarkerTitle}</div>`;
    HaifamarkerTitle = HaifamarkerTitle.replace(/<p>(.*?)<\/p>/g, '<p style="font-size: 16px; margin-top: -8px; margin-bottom: 5px; text-indent: 28px; direction:rtl">$1</p>');
    HaifamarkerTitle = HaifamarkerTitle.replace(/<b>(.*?)<\/b>/g, '<b style="font-size: 15px; font-wight: bold;">$1</b>');
  

    Haifa_markerData[i].title = HaifamarkerTitle;
}