 Hebron_markerData = [

       {
          lat: 31.4312949, lng: 35.0254031,
          title: "<h3> أبو العسجا / أبو الغزلان </h3> ",
       },
       {
          lat: 31.432483, lng: 34.923331,
          title: "<h3> البرج </h3> ",
       },
       {
          lat: 31.6744654, lng: 35.0944666,
          title: "<h3> الجبعة </h3> ",
       },
       {
          lat: 31.4010666, lng: 35.068509,
          title: "<h3> السموع </h3> ",
       },
       {
          lat: 31.5712, lng: 34.8538,
          title: "<h3> القبيبة: قبيبة بني عواد </h3> ",
       },
       {
          lat: 31.679, lng: 34.8227,
          title: "<h3> بركوسيا </h3> ",
       },
       {
          lat: 31.4617617, lng: 34.944484,
          title: "<h3> بيت الروش التحتا </h3> ",
       },
       {
          lat: 31.5705454, lng: 35.0864406,
          title: "<h3> بيت كاحل </h3> ",
       },
       {
          lat: 31.5773283, lng: 35.0316836,
          title: "<h3> ترقوميا </h3> ",
       },
       {
          lat: 31.5798893, lng: 35.0999042,
          title: "<h3> حلحول </h3> ",
       },
       {
          lat: 31.6729, lng: 34.8916,
          title: "<h3> دير الذبان </h3> ",
       },
       {
          lat: 31.5199273, lng: 34.9901806,
          title: "<h3> دير سامت </h3> ",
       },
       {
          lat: 31.4313803, lng: 35.0393636,
          title: "<h3> رابود </h3> ",
       },
       {
          lat: 31.4783659, lng: 35.0449114,
          title: "<h3> مخيم الفوار </h3> ",
       },
       {
          lat: 31.5368, lng: 34.9125,
          title: "<h3> الدوايمه </h3> ",
       },
       {
          lat: 31.4231296, lng: 35.0438935,
          title: "<h3> السيميا، سيميا، سيمياء </h3> ",
       },
       {
          lat: 31.4807915, lng: 34.9598488,
          title: "<h3> المجد </h3> ",
       },
       {
          lat: 31.4526764, lng: 34.9437506,
          title: "<h3> بيت الروش الفوقا </h3> ",
       },
       {
          lat: 31.4538674, lng: 34.9296796,
          title: "<h3> بيت مرسم </h3> ",
       },
       {
          lat: 31.5384464, lng: 35.0334634,
          title: "<h3> تفوح </h3> ",
       },
       {
          lat: 31.6257754, lng: 35.0693067,
          title: "<h3> خاراس </h3> ",
       },
       {
          lat: 31.4811243, lng: 35.0061292,
          title: "<h3> خرسا </h3> ",
       },
       {
          lat: 31.4734284, lng: 34.9627946,
          title: "<h3> دير العسل التحتا </h3> ",
       },
       {
          lat: 31.471351, lng: 35.0017381,
          title: "<h3> صرة / الصرة- الخليل </h3> ",
       },
       {
          lat: 31.689, lng: 34.9217,
          title: "<h3> عجور </h3> ",
       },
       {
          lat: 31.480123, lng: 34.984387,
          title: "<h3> مراح البقار/ الصرة-دورا </h3> ",
       },
       {
          lat: 31.4441483, lng: 35.1076146,
          title: "<h3> يطا </h3> ",
       },
       {
          lat: 31.48532, lng: 34.917721,
          title: "<h3> أم الشقف  / دير المحيسن </h3> ",
       },
       {
          lat: 31.4885065, lng: 35.05476,
          title: "<h3> الهجرة </h3> ",
       },
       {
          lat: 31.6066, lng: 34.8965,
          title: "<h3> بيت جبرين </h3> ",
       },
       {
          lat: 31.703, lng: 34.8462,
          title: "<h3> تل الصافي </h3> ",
       },
       {
          lat: 31.4136327, lng: 35.2300784,
          title: "<h3> خلة الضبع / مسافر يطا: مهددة بالإزالة </h3> ",
       },
       {
          lat: 31.4668513, lng: 34.9565546,
          title: "<h3> دير العسل الفوقا </h3> ",
       },
       {
          lat: 31.5050922, lng: 35.0362818,
          title: "<h3> دورا </h3> ",
       },
       {
          lat: 31.6652, lng: 34.8782,
          title: "<h3> رعنا </h3> ",
       },
       {
          lat: 31.5824725, lng: 35.1525308,
          title: "<h3> سعير </h3> ",
       },
       {
          lat: 31.6495503, lng: 35.0822216,
          title: "<h3> صوريف </h3> ",
       },
       {
          lat: 31.3756562, lng: 34.9145138,
          title: "<h3> عرب الرماضين </h3> ",
       },
       {
          lat: 31.4425253, lng: 35.0072132,
          title: "<h3> كرزة </h3> ",
       },
       {
          lat: 31.4136327, lng: 35.2300784,
          title: "<h3> مسافر يطا/ قرى مهددة بالزوال </h3> ",
       },
       {
          lat: 31.5572503, lng: 34.9967526,
          title: "<h3> إذنا </h3> ",
       },
       {
          lat: 31.4074916, lng: 35.1607313,
          title: "<h3> التواني : الطواني: قرى مهددة بالزوال </h3> ",
       },
       {
          lat: 31.4704764, lng: 35.0964126,
          title: "<h3> الريحية </h3> ",
       },
       {
          lat: 31.4096363, lng: 34.9930176,
          title: "<h3> الظاهرية </h3> ",
       },
       {
          lat: 31.4598517, lng: 34.9947818,
          title: "<h3> امريش </h3> ",
       },
       {
          lat: 31.5984198, lng: 35.0057754,
          title: "<h3> بيت أولا </h3> ",
       },
       {
          lat: 31.5067163, lng: 34.9676706,
          title: "<h3> بيت عوا </h3> ",
       },
       {
          lat: 31.5346313, lng: 34.9840926,
          title: "<h3> تجمع قروي/ خربة الكوم-المورق-بيت مقدوم-حمصة </h3> ",
       },
       {
          lat: 31.4761553, lng: 35.0727486,
          title: "<h3> حدب الفوار / الحدب </h3> ",
       },
       {
          lat: 31.4333672, lng: 35.0929409,
          title: "<h3> خربة عزيز : العزيز، اعزيز، كفر عزيز </h3> ",
       },
       {
          lat: 31.467447, lng: 34.995469,
          title: "<h3> خلة العقد/ الصرة- دورا </h3> ",
       },
       {
          lat: 31.4727508, lng: 35.0450957,
          title: "<h3> دير رازح / محمية طبيعية </h3> ",
       },
       {
          lat: 31.6631, lng: 34.8602,
          title: "<h3> ذِكْرين البَرَدَان / زكرين </h3> ",
       },
       {
          lat: 31.9378, lng: 34.9696,
          title: "<h3> زكريا / زكريا البطيخ / اسطنبول / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.5097412, lng: 35.0372938,
          title: "<h3> سكة / سكا </h3> ",
       },
       {
          lat: 31.4883368, lng: 34.9600506,
          title: "<h3> طواس </h3> ",
       },
       {
          lat: 31.4890209, lng: 35.0043382,
          title: "<h3> فقيقيس </h3> ",
       },
       {
          lat: 31.7286, lng: 34.8821,
          title: "<h3> مغلس </h3> ",
       },
       
     

   ];







for (let i = 0; i < Hebron_markerData.length; i++) {
    let HebronmarkerTitle = Hebron_markerData[i].title;

    HebronmarkerTitle = `<div style="max-width: 400px; padding: 0px; text-align: right;">${HebronmarkerTitle}</div>`;
    HebronmarkerTitle = HebronmarkerTitle.replace(/<p>(.*?)<\/p>/g, '<p style="font-size: 16px; margin-top: -8px; margin-bottom: 5px; text-indent: 28px; direction:rtl">$1</p>');
    HebronmarkerTitle = HebronmarkerTitle.replace(/<b>(.*?)<\/b>/g, '<b style="font-size: 15px; font-wight: bold;">$1</b>');
  

    Hebron_markerData[i].title = HebronmarkerTitle;
}