 Jenin_markerData = [
       {
          lat: 32.4392359, lng: 35.3988527,
          title: "<h3> أمُّ التُوْت </h3> ",
       },
       {
          lat: 32.534613, lng: 35.1924239,
          title: "<h3> أم الفحم / قرى جنين المحتلة عام 1949 </h3> ",
       },
       {
          lat: 32.483454, lng: 35.141344,
          title: "<h3> أم الريحان / القرى المغلقة </h3> ",
       },
       {
          lat: 32.3346647, lng: 35.3368965,
          title: "<h3> الجديدة / جديدة / الخير </h3> ",
       },
       {
          lat: 32.5088123, lng: 35.3304656,
          title: "<h3> الجلمة </h3> ",
       },
       {
          lat: 32.4548686, lng: 35.1495628,
          title: "<h3> الخلجان / خِرْبَة الخُلْجَانْ </h3> ",
       },
       {
          lat: 32.3756917, lng: 35.2669695,
          title: "<h3> الزاوية </h3> ",
       },
       {
          lat: 32.3852003, lng: 35.3409886,
          title: "<h3> الزبابدة </h3> ",
       },
       {
          lat: 32.4350537, lng: 35.3066088,
          title: "<h3> الشُهَداء/ مُثَلَثَ الشُهَداء </h3> ",
       },
       {
          lat: 32.4475007, lng: 35.145549,
          title: "<h3> الطرم </h3> ",
       },
       {
          lat: 32.5186963, lng: 35.1979376,
          title: "<h3> الطيبة / طَيْبَة جنين </h3> ",
       },
       {
          lat: 32.4714123, lng: 35.2172756,
          title: "<h3> العرقة </h3> ",
       },
       {
          lat: 32.3308633, lng: 35.177738,
          title: "<h3> العطارة </h3> ",
       },
       {
          lat: 32.421446, lng: 35.3882938,
          title: "<h3> المغير - جنين </h3> ",
       },
       {
          lat: 32.3869287, lng: 35.225796,
          title: "<h3> المَنْصورَة </h3> ",
       },
       {
          lat: 32.4187082, lng: 35.4286708,
          title: "<h3> المطلة </h3> ",
       },
       {
          lat: 32.5244, lng: 35.3592,
          title: "<h3> المزار </h3> ",
       },
       {
          lat: 32.486617, lng: 35.233035,
          title: "<h3> اليامون </h3> ",
       },
       {
          lat: 32.5746, lng: 35.1778,
          title: "<h3> الْلَجُّونْ / قرى الروحة </h3> ",
       },
       {
          lat: 32.4308173, lng: 35.1414663,
          title: "<h3> امريحة </h3> ",
       },
       {
          lat: 32.4561328, lng: 35.2410884,
          title: "<h3> برقين </h3> ",
       },
       {
          lat: 32.4755012, lng: 35.1022728,
          title: "<h3> برطعة الغَرْبِيَّة </h3> ",
       },
       {
          lat: 32.519725, lng: 35.221058,
          title: "<h3> تعنك </h3> ",
       },
       {
          lat: 32.4246483, lng: 35.3820426,
          title: "<h3> جلقموس </h3> ",
       },
       {
          lat: 32.3250, lng: 35.22016,
          title: "<h3> جبع </h3> ",
       },
       {
          lat: 32.3852652, lng: 35.2672338,
          title: "<h3> جربا </h3> ",
       },
       {
          lat: 32.4574862, lng: 35.4215967,
          title: "<h3> جلبون </h3> ",
       },
       {
          lat: 32.4093663, lng: 35.2399467,
          title: "<h3> حَفِيرَة عرابة </h3> ",
       },
       {
          lat: 32.4758003, lng: 35.11841,
          title: "<h3> خربة عبد الله اليونس / القرى المغلقة </h3> ",
       },
       {
          lat: 32.4560593, lng: 35.3824316,
          title: "<h3> دير أبو ضَعِيف </h3> ",
       },
       {
          lat: 32.4955033, lng: 35.3693636,
          title: "<h3> دير غزالة </h3> ",
       },
       {
          lat: 32.526892, lng: 35.208114,
          title: "<h3> رمانة </h3> ",
       },
       {
          lat: 32.3868225, lng: 35.382663,
          title: "<h3> رابا </h3> ",
       },
       {
          lat: 32.4494422, lng: 35.1415648,
          title: "<h3> زبدة </h3> ",
       },
       {
          lat: 32.5573, lng: 35.3263,
          title: "<h3> زرعين </h3> ",
       },
       {
          lat: 32.5097613, lng: 35.2099374,
          title: "<h3> السيلة الحارثية </h3> ",
       },
       {
          lat: 32.3186233, lng: 35.1965992,
          title: "<h3> سيلة الظهر </h3> ",
       },
       {
          lat: 32.3282412, lng: 35.3026688,
          title: "<h3> سيريس </h3> ",
       },
       {
          lat: 32.3589005, lng: 35.246147,
          title: "<h3> صانور / سانور </h3> ",
       },
       {
          lat: 32.5230368, lng: 35.3313344,
          title: "<h3> صندلة </h3> ",
       },
       {
          lat: 32.3636947, lng: 35.3489665,
          title: "<h3> صير </h3> ",
       },
       {
          lat: 32.4662829, lng: 35.1586954,
          title: "<h3> طورة الشرقية </h3> ",
       },
       {
          lat: 32.4695332, lng: 35.1619018,
          title: "<h3> طورة الغربية </h3> ",
       },
       {
          lat: 32.4731653, lng: 35.1630228,
          title: "<h3> ظهر المالح / القرى المغلقة </h3> ",
       },
       {
          lat: 32.3599808, lng: 35.1773944,
          title: "<h3> عجة </h3> ",
       },
       {
          lat: 32.4032707, lng: 35.2409335,
          title: "<h3> عرابة </h3> ",
       },
       {
          lat: 32.3579679, lng: 35.209584,
          title: "<h3> عنزا / عنزة </h3> ",
       },
       {
          lat: 31.873015, lng: 35.4845693,
          title: "<h3> عين الديوك الفوقا </h3> ",
       },
       {
          lat: 32.5933, lng: 35.1773,
          title: "<h3> عين المنسي </h3> ",
       },
       {
          lat: 32.4578362, lng: 35.3359911,
          title: "<h3> عابا / عَابَا الغَرْبيِّة </h3> ",
       },
       {
          lat: 32.5017047, lng: 35.2012295,
          title: "<h3> عانين </h3> ",
       },
       {
          lat: 32.51249887698713, lng: 35.36333291951912,
          title: "<h3> عربونة </h3> ",
       },
       {
          lat: 32.4968533, lng: 35.3314908,
          title: "<h3> عرانة </h3> ",
       },
       {
          lat: 32.424982, lng: 35.108711,
          title: "<h3> فراسين </h3> ",
       },
       {
          lat: 32.3208673, lng: 35.2214576,
          title: "<h3> فندقومية / الفندقومية </h3> ",
       },
       {
          lat: 32.3820283, lng: 35.1977576,
          title: "<h3> فحمة </h3> ",
       },
       {
          lat: 32.3877491, lng: 35.224554,
          title: "<h3> فحمة الجَدِيدَة </h3> ",
       },
       {
          lat: 32.4095813, lng: 35.2625834,
          title: "<h3> قباطية </h3> ",
       },
       {
          lat: 32.4779753, lng: 35.2712966,
          title: "<h3> كفر دان </h3> ",
       },
       {
          lat: 35.225979, lng: 32.457284,
          title: "<h3> كفر قود </h3> ",
       },
       {
          lat: 32.3734163, lng: 35.1730456,
          title: "<h3> كفر راعي </h3> ",
       },
       {
          lat: 32.4435813, lng: 35.2206726,
          title: "<h3> كفيرات / الكُفَيْرِتْ </h3> ",
       },
       {
          lat: 32.468676, lng: 35.288968,
          title: "<h3> مقيبلة </h3> ",
       },
       {
          lat: 32.3492083, lng: 35.2889936,
          title: "<h3> ميثلون </h3> ",
       },
       {
          lat: 32.3965862, lng: 35.2491288,
          title: "<h3> مركة </h3> ",
       },
       {
          lat: 32.3857872, lng: 35.2970208,
          title: "<h3> مسلية </h3> ",
       },
       {
          lat: 32.5456819, lng: 35.173485,
          title: "<h3> مُصمُصْ / قرى جنين المحتلة عام 1949 </h3> ",
       },
       {
          lat: 32.4623863, lng: 35.1925406,
          title: "<h3> نزلة الشيخ / نزلة زيد </h3> ",
       },
       {
          lat: 32.534, lng: 35.3616,
          title: "<h3> نورس </h3> ",
       },
       {
          lat: 32.4438375, lng: 35.1750367,
          title: "<h3> يعبد </h3> ",
       },
       







	//Missing places in pdf
/*

       {
          lat: 32.3339505, lng: 35.2011079,
          title: "<h3> العصاعصة </h3> ",
       },
       {
          lat: 32.4623306, lng: 35.1204704,
          title: "<h3> خربة المُنْطَار / القرى المغلقة </h3> ",
       },
       {
          lat: 32.4491712, lng: 35.1132096,
          title: "<h3> ظَهْر العَبْد/ القرى المغلقة </h3> ",
       },
       {
          lat: 32.4643992, lng: 35.1842049,
          title: "<h3> عرب الحَمْدُون / القرى المغلقة </h3> ",
       },
       {
          lat: 32.4545635, lng: 35.3347719,
          title: "<h3> عَابَا الشَرْقيِّة / وادي الضَبِع </h3> ",
       },
       {
          lat: 32.4678382, lng: 35.1781222,
          title: "<h3> بَرْطَعَة الشَرْقِيَّة / القرى المغلقة </h3> ",
       },
       {
          lat: 32.42964, lng: 35.133789,
          title: "<h3> خربة المْكَحّل/ القرى المغلقة </h3> ",
       },
       {
          lat: 32.5500053, lng: 35.2204059,
          title: "<h3> زَلْفَة/قرى جنين المحتلة عام 1949 </h3> ",
       },
       {
          lat: 32.5446912, lng: 35.2088988,
          title: "<h3> سَالِمْ/ قرى جنين المحتلة عام 1949 </h3> ",
       },
       {
          lat: 32.3922255, lng: 35.2222977,
          title: "<h3> وادي دْعُوق </h3> ",
       },
       {
          lat: 32.5528955, lng: 35.1687109,
          title: "<h3> مُشَيْرِفَة/ قرى جنين المحتلة عام 1949 </h3> ",
       },
       {
          lat: 32.5059849, lng: 35.2041641,
          title: "<h3> السَعَايّدَة </h3> ",
       },
       {
          lat: 32.5564193, lng: 35.2026399,
          title: "<h3> بَيَّاضَة/ قرى جنين المحتلة عام 1949 </h3> ",
       },
       {
          lat: 32.5319602, lng: 35.1131528,
          title: "<h3> مُعَاوِيّة/ قرى جنين المحتلة عام 1949 </h3> ",
       },



*/
     

   ];







for (let i = 0; i < Jenin_markerData.length; i++) {
    let JeninmarkerTitle = Jenin_markerData[i].title;

    JeninmarkerTitle = `<div style="max-width: 400px; padding: 0px; text-align: right;">${JeninmarkerTitle}</div>`;
    JeninmarkerTitle = JeninmarkerTitle.replace(/<p>(.*?)<\/p>/g, '<p style="font-size: 16px; margin-top: -8px; margin-bottom: 5px; text-indent: 28px; direction:rtl">$1</p>');
    JeninmarkerTitle = JeninmarkerTitle.replace(/<b>(.*?)<\/b>/g, '<b style="font-size: 15px; font-wight: bold;">$1</b>');
  

    Jenin_markerData[i].title = JeninmarkerTitle;
}