 Jerusalem_markerData = [

       {
          lat: 31.76358656097546, lng: 35.25637016665648,
          title: "<h3> أبو دِيِسْ </h3> ",
       },
       {
          lat: 31.7217104, lng: 34.9260959,
          title: "<h3> البريج / بيارات بريج </h3> ",
       },
       {
          lat: 31.8034627, lng: 35.3337503,
          title: "<h3> الخان الأحمر </h3> ",
       },
       {
          lat: 31.7582263, lng: 35.2599036,
          title: "<h3> السواحرة الغربية </h3> ",
       },
       {
          lat: 31.7278, lng: 35.1197,
          title: "<h3> القبو </h3> ",
       },
       {
          lat: 31.8330223, lng: 35.1980556,
          title: "<h3> النبي صَمويل / صموئيل </h3> ",
       },
       {
          lat: 31.818056, lng: 35.180556,
          title: "<h3> بيت إكسا </h3> ",
       },
       {
          lat: 31.8301293, lng: 35.2427146,
          title: "<h3> بيت حنينا </h3> ",
       },
       {
          lat: 31.7460726, lng: 35.218011,
          title: "<h3> بيت صفافا </h3> ",
       },
       {
          lat: 31.8593779, lng: 35.0527636,
          title: "<h3> بيت نوبا / قرى اللطرون / بين رام الله والرملة </h3> ",
       },
       {
          lat: 31.8344054, lng: 35.1307294,
          title: "<h3> بِدُّو </h3> ",
       },
       {
          lat: 31.8364594, lng: 35.2807406,
          title: "<h3> حزما </h3> ",
       },
       {
          lat: 31.7938, lng: 35.0985,
          title: "<h3> خربة العمور / دير عمرو </h3> ",
       },
       {
          lat: 31.751, lng: 35.0363,
          title: "<h3> دير الهوا / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.737, lng: 35.092,
          title: "<h3> راس أبو عمار / رأس أبو عمار / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.7701264, lng: 35.2535776,
          title: "<h3> سلوان / حامية القدس </h3> ",
       },
       {
          lat: 31.7830084, lng: 35.1562439,
          title: "<h3> صوبا </h3> ",
       },
       {
          lat: 31.7841, lng: 35.0067,
          title: "<h3> عسلين </h3> ",
       },
       {
          lat: 31.7994522, lng: 35.2460273,
          title: "<h3> عناتا </h3> ",
       },
       {
          lat: 31.7808, lng: 35.0505,
          title: "<h3> كسلا / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.8711283, lng: 35.2953066,
          title: "<h3> مخماس </h3> ",
       },
       {
          lat: 31.8065008, lng: 35.1260716,
          title: "<h3> أبو غوش / قرية العنب </h3> ",
       },
       {
          lat: 31.8566033, lng: 35.2151956,
          title: "<h3> الجديرة </h3> ",
       },
       {
          lat: 31.8492503, lng: 35.2509986,
          title: "<h3> الرام </h3> ",
       },
       {
          lat: 31.7940603, lng: 35.2437493,
          title: "<h3> الشيخ جَرّاح/ حي الشيخ جَرّاح </h3> ",
       },
       {
          lat: 31.7293923, lng: 35.1760396,
          title: "<h3> الولجة </h3> ",
       },
       {
          lat: 31.7808, lng: 35.0817,
          title: "<h3> بيت ام الميس / خربة ام الميس </h3> ",
       },
       {
          lat: 31.8594153, lng: 35.1132294,
          title: "<h3> بيت دقو </h3> ",
       },
       {
          lat: 31.8510634, lng: 35.1292286,
          title: "<h3> بيت عنان </h3> ",
       },
       {
          lat: 31.8511804, lng: 35.2183446,
          title: "<h3> بير نبالا </h3> ",
       },
       {
          lat: 31.8652989, lng: 35.2775859,
          title: "<h3> جبع </h3> ",
       },
       {
          lat: 31.7795465, lng: 35.246521,
          title: "<h3> حي الطور / قرية الطور / جبل الزيتون </h3> ",
       },
       {
          lat: 31.7431363, lng: 35.1769684,
          title: "<h3> خربة بيت ارزه </h3> ",
       },
       {
          lat: 31.8701803, lng: 35.1750584,
          title: "<h3> رافات </h3> ",
       },
       {
          lat: 31.7431363, lng: 35.1769684,
          title: "<h3> شرفات </h3> ",
       },
       {
          lat: 31.7386483, lng: 35.2500266,
          title: "<h3> صور باهر </h3> ",
       },
       {
          lat: 31.7906342, lng: 35.1219808,
          title: "<h3> عين رافة / رافا </h3> ",
       },
       {
          lat: 31.8747046, lng: 35.2362945,
          title: "<h3> كفر عقب </h3> ",
       },
       {
          lat: 31.8368, lng: 35.0653,
          title: "<h3> نطاف </h3> ",
       },
       {
          lat: 31.7308063, lng: 35.2498596,
          title: "<h3> أم طوبا/القدس </h3> ",
       },
       {
          lat: 31.771831, lng: 35.24403,
          title: "<h3> الجورة/ القدس </h3> ",
       },
       {
          lat: 31.7804902, lng: 35.3161138,
          title: "<h3> العيزرية </h3> ",
       },
       {
          lat: 31.7954, lng: 35.1432,
          title: "<h3> القسطل </h3> ",
       },
       {
          lat: 31.7928884, lng: 35.053863,
          title: "<h3> بيت محسير </h3> ",
       },
       {
          lat: 31.7281984, lng: 35.1277323,
          title: "<h3> بَتِّير/من قرى بيت لحم الآن ومن قرى القدس سابقاً </h3> ",
       },
       {
          lat: 31.783, lng: 34.9554,
          title: "<h3> خربة اسم الله </h3> ",
       },
       {
          lat: 31.7662, lng: 35.1123,
          title: "<h3> خِرْبَةُ اللَّوزْ </h3> ",
       },
       {
          lat: 31.7741, lng: 34.9587,
          title: "<h3> دير رافات / واد الصرار </h3> ",
       },
       {
          lat: 31.7969, lng: 35.0733,
          title: "<h3> ساريس / سيريس </h3> ",
       },
       {
          lat: 31.8138715, lng: 35.2518953,
          title: "<h3> شُعْفَاط </h3> ",
       },
       {
          lat: 31.7696, lng: 35.1262,
          title: "<h3> صَطَاف/ سَطَاف </h3> ",
       },
       {
          lat: 31.7671309, lng: 35.1707411,
          title: "<h3> عَينْ كَارِمْ </h3> ",
       },
       {
          lat: 31.8269213, lng: 35.1277096,
          title: "<h3> قطنة </h3> ",
       },
       {
          lat: 31.7967, lng: 35.196,
          title: "<h3> لفتا </h3> ",
       },
       {
          lat: 31.7138093, lng: 35.4289544,
          title: "<h3> وادي قدرون / وادي الجحيم </h3> ",
       },
       {
          lat: 31.7803, lng: 35.0109,
          title: "<h3> إشوع / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.8509874, lng: 35.1655934,
          title: "<h3> الجيب </h3> ",
       },
       {
          lat: 31.7506425, lng: 35.2787471,
          title: "<h3> السواحرة الشرقية </h3> ",
       },
       {
          lat: 31.7972263, lng: 35.2636836,
          title: "<h3> العيسوية </h3> ",
       },
       {
          lat: 31.7525, lng: 35.1819,
          title: "<h3> المالحة </h3> ",
       },
       {
          lat: 31.8475765, lng: 35.1703686,
          title: "<h3> بيت إجزا </h3> ",
       },
       {
          lat: 31.7245403, lng: 34.9940306,
          title: "<h3> بيت جِمال (الحكمة)/ بيت إجمال/ دير بيت إجمال / من  قرى  عرقوب </h3> ",
       },
       {
          lat: 31.8247494, lng: 35.1302214,
          title: "<h3> بيت سوريك </h3> ",
       },
       {
          lat: 31.8047949, lng: 35.1312433,
          title: "<h3> بيت نقوبا / نقوبة /عين نقوبا </h3> ",
       },
       {
          lat: 31.7342, lng: 35.0526,
          title: "<h3> بَيَّتْ عَطَابْ / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.8652989, lng: 35.2775859,
          title: "<h3> جَبَعْ- تجمع بدوي جَبَعْ </h3> ",
       },
       {
          lat: 31.7153, lng: 35.0484,
          title: "<h3> خربة التنور / علار السفلى / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.7485, lng: 35.066,
          title: "<h3> دير الشيخ / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.7857, lng: 35.178,
          title: "<h3> دَيْر يَاسِيّنْ </h3> ",
       },
       {
          lat: 31.7346, lng: 35.0408,
          title: "<h3> سفلى / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.9269292, lng: 34.8310481,
          title: "<h3> صرعة / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.8972587, lng: 35.0254149,
          title: "<h3> عرتوف / عرطوف / بيت الشمس / من قرى عرقوب </h3> ",
       },
       {
          lat: 31.84, lng: 34.9906,
          title: "<h3> عمواس/ قرى اللطرون / بين رام الله والرملة </h3> ",
       },
       {
          lat: 31.7927364, lng: 35.1825886,
          title: "<h3> قالونيا </h3> ",
       },
       {
          lat: 31.8615965, lng: 35.207914,
          title: "<h3> قلنديا </h3> ",
       },
       
     

   ];







for (let i = 0; i < Jerusalem_markerData.length; i++) {
    let JerusalemmarkerTitle = Jerusalem_markerData[i].title;

    JerusalemmarkerTitle = `<div style="max-width: 400px; padding: 0px; text-align: right;">${JerusalemmarkerTitle}</div>`;
    JerusalemmarkerTitle = JerusalemmarkerTitle.replace(/<p>(.*?)<\/p>/g, '<p style="font-size: 16px; margin-top: -8px; margin-bottom: 5px; text-indent: 28px; direction:rtl">$1</p>');
    JerusalemmarkerTitle = JerusalemmarkerTitle.replace(/<b>(.*?)<\/b>/g, '<b style="font-size: 15px; font-wight: bold;">$1</b>');
  

    Jerusalem_markerData[i].title = JerusalemmarkerTitle;
}