 Ramallah_markerData = [

       {
          lat: 31.96472222, lng: 35.17361111,
          title: "<h3> أبو شخيدم </h3> ",
       },
       {
          lat: 31.938333, lng: 35.121944,
          title: "<h3> الجانية </h3> ",
       },
       {
          lat: 31.9360913, lng: 34.9870644,
          title: "<h3> المدية / الرملة سابقا ورام الله حاليا: من القرة التسعة </h3> ",
       },
       {
          lat: 31.9681096, lng: 35.0077698,
          title: "<h3> بدرس </h3> ",
       },
       {
          lat: 32.053016, lng: 35.124891,
          title: "<h3> بيت إللو / بيتللو </h3> ",
       },
       {
          lat: 31.888122, lng: 35.125422,
          title: "<h3> بيت عور الفوقا </h3> ",
       },
       {
          lat: 31.9753135, lng: 35.196042,
          title: "<h3> بيْرزَيَتْ </h3> ",
       },
       {
          lat: 32.0135055, lng: 35.3038872,
          title: "<h3> خربة أبو فلاح </h3> ",
       },
       {
          lat: 31.959094, lng: 35.226645,
          title: "<h3> دورا القرع </h3> ",
       },
       {
          lat: 32.031712, lng: 35.149204,
          title: "<h3> السودان </h3> ",
       },
       {
          lat: 31.001724, lng: 35.113691,
          title: "<h3> دير نظام </h3> ",
       },
       {
          lat: 32.029973, lng: 35.018973,
          title: "<h3> رنتيس </h3> ",
       },
       {
          lat: 31.9742893, lng: 35.0330484,
          title: "<h3> شبتين/ رام الله: من القرى التسعة </h3> ",
       },
       {
          lat: 32.0165373, lng: 35.0863166,
          title: "<h3> عبود / عابود </h3> ",
       },
       {
          lat: 31.9757541, lng: 35.2288487,
          title: "<h3> عين سينيا </h3> ",
       },
       {
          lat: 31.8396995, lng: 35.169200,
          title: "<h3> قبية /  قبيا كانت تتبع القدس: من القرى التسعة </h3> ",
       },
       {
          lat: 31.9899459, lng: 35.1378434,
          title: "<h3> كوبر </h3> ",
       },
       {
          lat: 31.94883, lng: 35.18426,
          title: "<h3> أبو قَشّ </h3> ",
       },
       {
          lat: 31.9581123, lng: 35.2809734,
          title: "<h3> الطيبة </h3> ",
       },
       {
          lat: 32.0032985, lng: 35.2770104,
          title: "<h3> المزرعة الشرقية </h3> ",
       },
       {
          lat: 31.8960763, lng: 35.2650678,
          title: "<h3> برقة - برقا رام الله </h3> ",
       },
       {
          lat: 32.0357262, lng: 35.1013962,
          title: "<h3> بيت ريما </h3> ",
       },
       {
          lat: 31.8699353, lng: 35.0827116,
          title: "<h3> بيت لقيا: كانت تتبع الرملة سابقا </h3> ",
       },
       {
          lat: 31.927063, lng: 35.237597,
          title: "<h3> بَيتْين </h3> ",
       },
       {
          lat: 35.059976, lng: 32.003795,
          title: "<h3> دير أبو مشعل </h3> ",
       },
       {
          lat: 31.965356, lng: 35.294515,
          title: "<h3> دير جرير </h3> ",
       },
       {
          lat: 31.912788, lng: 35.2635161,
          title: "<h3> ديردبوان </h3> ",
       },
       {
          lat: 31.941063, lng: 35.202925,
          title: "<h3> سردا / صردا </h3> ",
       },
       {
          lat: 31.9890813, lng: 35.0220064,
          title: "<h3> شُقبَا / شُقبَة:كانت تتبع الرملة سابقا، من القرى التسعة </h3> ",
       },
       {
          lat: 32.0307933, lng: 35.2185246,
          title: "<h3> عبوين </h3> ",
       },
       {
          lat: 31.908599, lng: 35.143050,
          title: "<h3> عين عريك </h3> ",
       },
       {
          lat: 32.0525368, lng: 35.1048314,
          title: "<h3> قراوة بني زيد </h3> ",
       },
       {
          lat: 32.0512278, lng: 35.173013,
          title: "<h3> مزارع النوباني </h3> ",
       },
       {
          lat: 32.0088864, lng: 35.1744508,
          title: "<h3> أم صفا </h3> ",
       },
       {
          lat: 31.9113725, lng: 35.1770129,
          title: "<h3> الطيرة </h3> ",
       },
       {
          lat: 31.9515993, lng: 35.1332324,
          title: "<h3> المزرعة القبلية </h3> ",
       },
       {
          lat: 31.989255, lng: 35.175464,
          title: "<h3> برهام </h3> ",
       },
       {
          lat: 31.8874247, lng: 35.0803395,
          title: "<h3> بيت سيرا </h3> ",
       },
       {
          lat: 31.975781, lng: 35.114660,
          title: "<h3> بيتللو </h3> ",
       },
       {
          lat: 31.971779, lng: 35.091440,
          title: "<h3> جمالا </h3> ",
       },
       {
          lat: 35.071091, lng: 35.885375,
          title: "<h3> خربثا المصباح </h3> ",
       },
       {
          lat: 32.046749, lng: 35.0986016,
          title: "<h3> دير غسانة/ ديرغسانة </h3> ",
       },
       {
          lat: 35.127014, lng: 31.898503,
          title: "<h3> راس كركر </h3> ",
       },
       {
          lat: 31.9793892, lng: 35.2531102,
          title: "<h3> سلواد </h3> ",
       },
       {
          lat: 31.9018255, lng: 35.0791824,
          title: "<h3> صفّا </h3> ",
       },
       {
          lat: 32.0230343, lng: 35.1629294,
          title: "<h3> عجّول </h3> ",
       },
       {
          lat: 31.9278969, lng: 35.129126,
          title: "<h3> عين قِينْيَا/ قِينْيَا </h3> ",
       },
       {
          lat: 32.0451223, lng: 35.1413166,
          title: "<h3> كفر عين </h3> ",
       },
       {
          lat: 31.9468413, lng: 35.0389706,
          title: "<h3> نعلين: من القرى التسعة </h3> ",
       },
       {
          lat: 31.9125625, lng: 35.221717,
          title: "<h3> البيرة </h3> ",
       },
       {
          lat: 32.0357743, lng: 35.0208554,
          title: "<h3> اللبن الغربي </h3> ",
       },
       {
          lat: 32.0109244, lng: 35.3412282,
          title: "<h3> المغير - رام الله </h3> ",
       },
       {
          lat: 31.9285143, lng: 35.0884636,
          title: "<h3> بلعين: من القرى التسعة </h3> ",
       },
       {
          lat: 31.893102, lng: 35.0840453,
          title: "<h3> بيت عور التحتا </h3> ",
       },
       {
          lat: 31.8892793, lng: 35.1873226,
          title: "<h3> بيتونيا </h3> ",
       },
       {
          lat: 31.997098, lng: 35.161405,
          title: "<h3> جِيبْيَا </h3> ",
       },
       {
          lat: 35.069887, lng: 31.944891,
          title: "<h3> خربثا بن الحارث: من القرى التسعة </h3> ",
       },
       {
          lat: 31.915733, lng: 35.119195,
          title: "<h3> دير إبزيغ </h3> ",
       },
       {
          lat: 35.045725, lng: 31.948498,
          title: "<h3> دير قديس: من القرى التسعة </h3> ",
       },
       {
          lat: 31.927284, lng: 35.299513,
          title: "<h3> رمون </h3> ",
       },
       {
          lat: 32.0336053, lng: 35.2464254,
          title: "<h3> سنجل </h3> ",
       },
       {
          lat: 31.4653007, lng: 34.6074016,
          title: "<h3> عارورة </h3> ",
       },
       {
          lat: 32.002078, lng: 35.2238676,
          title: "<h3> عطارة </h3> ",
       },
       {
          lat: 31.9532537, lng: 35.2848715,
          title: "<h3> عين يبرود </h3> ",
       },
       {
          lat: 31.9244348, lng: 35.0763254,
          title: "<h3> كفر نعمة </h3> ",
       },
       {
          lat: 31.975287, lng: 35.243822,
          title: "<h3> يبرود </h3> ",
       },
       
       
     

   ];







for (let i = 0; i < Ramallah_markerData.length; i++) {
    let RamallahmarkerTitle = Ramallah_markerData[i].title;

    RamallahmarkerTitle = `<div style="max-width: 400px; padding: 0px; text-align: right;">${RamallahmarkerTitle}</div>`;
    RamallahmarkerTitle = RamallahmarkerTitle.replace(/<p>(.*?)<\/p>/g, '<p style="font-size: 16px; margin-top: -8px; margin-bottom: 5px; text-indent: 28px; direction:rtl">$1</p>');
    RamallahmarkerTitle = RamallahmarkerTitle.replace(/<b>(.*?)<\/b>/g, '<b style="font-size: 15px; font-wight: bold;">$1</b>');
  

    Ramallah_markerData[i].title = RamallahmarkerTitle;
}