 Safad_markerData = [
     // Don't forget to add markers at the start
       {
       lat: 33.25989001976177, lng: 35.58019440028454,
          title: "<h3>:آبل القمح </h3> "+
	  "<p> تقع قرية آبل القمح شمال شرق صفد وتربطها بصفد طريق معبدة طولها نحو 43 كم وتبعد القرية قرابة كيلومتر واحد عن الحدود اللبنانية الفلسطينية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عبده، كرواني، حرقوش، حداد </p>",
       },
       {
       lat: 32.91629998093015, lng: 35.622900002413864,
          title: "<h3>:اﻟﺒﻄﻴﺤﺔ </h3>"+
	  "<p> البطيحة واحدة من قرى قضاء صفد كانت تقع في منطقة كثيرة من التلال بالقرب من "+
	  " الحدود السورية . الفلسطينية، وتبعد نحو ربع كيلومتر إلى الشرق من نهر الأردن، وكيلومترين "+
	  " عن بحيرة طبريا، وكانت تطل على رقعة واسعة من الأرض إلى الجنوب من مدينة طبريا  </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عرب السلوط، عرب الزبيد </p>",
       },
       {
       lat: 33.15829998085766, lng: 35.5690993318558,
          title: "<h3>:البويزية </h3>"+
	  "<p> البويزية قرية فلسطينية تبعد 22 كيلومتر شمال شرق مدينة صفد، استولت القوات "+
	  "  ،الصهيونية على البويزية في 11 مايو 1948، في أثناء الهجوم الذي شن على الجليل الشرقي "+
	  " والذي سمي عملية يفتاح </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> تمیم، شحادة، دخل الله عمايري، شرشرة، الاسدي، شقرة، عرب الغوانة </p>",
       },
      {
       lat: 32.9716, lng: 35.5324,
          title: "<h3>:الجاعونة </h3> "+
	  "<p> الجاعونة تقع على سفح جبل كنعان وتشرف على غور الأردن من الجهات كافة، ما عدا الغرب، وكانت قريبة من الجانب الغربي لطريق عام يوصل إلى صفد وطبريا، في سنة 1596، كانت الجاعونة قرية في ناحية جيرة (لواء صفد)، وعدد سكانها 171 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الحوراني، علي، جربوع، دخل، الله، شحاده، استيتيه، سالم، علي، زيتونه، السيد، اللوباني، يونس، الكردي، عواد، تميم، العمايري، جلبوط، كوسا، دراج، أبو عيد، أبو حسين، الزعبي، حليحل، القادري، شعبان، عبد الله </p>",
       },
       {
       lat: 33.02389398089806, lng: 35.447086331858976,
          title: "<h3>:الجش </h3>"+
	  "<p> <bdi>،<bdi>قريه الجش في أقصى الجليل الأعلى، حوالي 4 كم إلى الشمال من جبل الجرمق "+
	  " والجش هي إحدى قرى قضاء صفد، تبلغ مساحة أراضيها حوالي 12، 500 دونم، يحد القرية "+
	  " من الشمال أراضي قريه كفر برعم المهجره، ومن جهة الغرب أراضي قرية سعسع (اليوم كيبوتس "+
	  " سعسع، ومن جهة الجنوب الصفصاف (اليوم، سفسوفة)، ومن جهه الشرق تحدها أراضي قرى قديثا وطيطبا ودلاتا  (اليوم، دلتون) والرأس الأحمر (اليوم - كيرم بن زمرة)، يحد القرية واديان<bdi>:<bdi> <br>"+
	  " وادي الجش ووادي ،ناصر وادي الجش به العديد من الينابيع والعيون المائي </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> تمیم، شحادة، دخل الله عمايري، شرشرة، الاسدي، شقرة، عرب الغوانة </p>",
       },
      {
       lat: 33.1531, lng: 35.6469,
          title: "<h3>:الحمراء</h3> "+
	  "<p> تقع قرية الحمراء على السفوح الدنيا لمرتفعات الجولان، وكانت تشرف على سهل الحولة من الجهات كلها، باستثناء الشرق، وتواجه قرية المفتخرة التي تبعد عنها نحو كيلومتر إلى الشمال الغربي، وكان وادي الدفيلة، الذي تنحدر مياه مرتفعات الجولان إليه، يمتد بين القريتين على محور شمالي شرقي، جنوبي غربي، وينعطف انعطافاً حاداً صوب الجنوب، في الأسفل من المفتخرة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> آل أبو مطر </p>",
       },
      {
       lat: 33.05352, lng: 35.608122,
          title: "<h3>:الحسينية </h3> "+
	  "<p> الحسينية كانت قرية فلسطينية تبعد 11 كيلومتر شمال شرق مدينة صفد </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> رابح، دحمان، كانون، أحمد، هادي، فارس، نعیم، شحادة، الشرشرة، ربيع، محجوب، خيرية، العيسى </p>",
       },
      {
       lat: 33.214, lng: 35.5674,
          title: "<h3>:الخالصة </h3> "+
	  "<p> الخالصة قرية فلسطينية مهجرة، اقيمت على انقاضها مدينة كريات شمونة كانت في العهد العثماني من أعمال قضاء مرجعيون، تقع على مسافة 28 كم في الشمال الشرقي لصفد، وتبعد عن المطلة الواقعة على الحدود اللبنانية مسافة 10 كم تقريباً </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عشيره الغوارنة، نعيرات، السعاتي، الطيفوري، سويلم </p>",
       },
      {
       lat: 33.2242, lng: 35.6193,
          title: "<h3>:الخصاص </h3> "+
	  "<p> الخصاص كانت قرية فلسطينية تبعد 31 كيلومتر شمال شرق مدينة صفد، تقع في الجزء الشمالي من سهل الحولة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> السوالمة، قاسم، خليل، حليمة، مراد، السعدي، عباس، الفار، الصفدي، النهواني </p>",
       },
      {
       lat: 33.0352185, lng: 35.6445131,
          title: "<h3>:الدردارة </h3> "+
	  "<p> الدردارة كانت قرية فلسطينية تبعد 13 كيلومتر شرق مدينة صفد </p>",
       },
      {
       lat: 33.0886, lng: 35.6473,
          title: "<h3>:الدرباشية </h3> "+
	  "<p> الدرياشية قرية عربية تقع إلى الشمال الشرقي من مدينة صفد على الطرف الشرقي لسهل الحولة وسفوح مرتفعات الجولان السورية المشرفة عليها من علو يتجاوز 450 م، وأقرب قرية إليهاءهي غرابة، وإلى الجنوب منها تقع خربة عين التينة، والدرباشية إحدى قرى الحدود الفلسطينية ء السورية، ويصلها درب ترابي بقرية حفر في الهضبة السورية، وقد أقيم إلى الجنوب منها مركز للشرطة أيام الانتداب البريطاني، تعلو القرية 150 م عن سطح البحر رغم أنها منخفضة بالنسبة إلى المرتفعات السورية في الشرق، وإلى الشمال منها يخترق الهضبة السورية وادي الحنظل أحد روافد الوادي الذي كان ينتهي في بحيرة الحولة من الجهة الشمالية الشرقية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> قطيش، شحادة، مهاوش، صالح، آل كرمة </p>",
       },
      {
       lat: 33.1783, lng: 35.6324,
          title: "<h3>:الدوّارة </h3> "+
	  "<p> الدوارة التي تقع في الشرق من الشيخ يوسف حيث تلتقي منابع الأردن، أما تقع بين قريتي المفتخرة والعابسية، وهذه اقرب قرية لها، كانت الدوارة في العهد العثماني قرية من أعمال مرجعيون مساحتها 52 دونماً </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الشيلات، الجواسمة، السمرات، الصالح، الخطايبة، البراهمة، تيم، مصطفى، العزوز، الصالح، قاسم، سارة، الأمين، عبدالعال، الشلحاوي، ملحم، الزعل، العلي، العقدات </p>",
       },
      {
       lat: 33.0392, lng: 35.4683,
          title: "<h3>:الرأس الأحمر </h3> "+
	  "<p> تقع الرأس الأحمر إلى الشمال من مدينة صفد وتبعد عنها 12 كم، وترتفع 820 م عن سطح البحر تبلغ مساحة أراضيها حوالي 7934 دونماً تحيط بها أراضي قرى الريحانية وفارة وطيطبا والجش وكفر برعم وقدر عدد سكانها عام 1922 حوالي (405) نسمة، وفي القرية الحمرا صفد، المصنفة مزرعة في (معجم فلسطين الجغرافي المفهرس ) ( Gazetteer Palestine Index) ، تقع على السفوح الدنيا لمرتفعات الجولان، وكانت تشرف على سهل الحولة من الجهات كلها، باستثناء الشرق، وتواجه قرية المفتخرة التي تبعد عنها نحو كيلو متر إلى الشمال الغربي، وكان وادي الدفيلة، الذي تنحدر مياه مرتفعات الجولان إليه، يمتد بين القريتين على محور شمالي شرقي، جنوبي غربي، وينعطف انعطافاً حاداً صوب الجنوب، في الأسفل من المفتخرة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> أكبر عائلتين فيها الخطيب وايوب: ابراهيم، أبو شحادة، أبو الهيجا، العلي، بزاري، كردية، بكري، البيروتي، حجازي، حريري، حشمة، حمزة، خليل، دخل الله، عيسى، سلیمان، سيف، شراري، الشياب، صالح، عباس، عبد الخالق، عبدالرحمن، عبدي، عجاوي، عزام، عطية، عقل، عينا، غنام، فاعور، قاسم، مكية، الحسن، مسلم، مصري، ماروني، ميداني، نصار، نابلسي، هجاج، شحرور، النقيب </p>",
       },
      {
       lat: 32.9648548, lng: 35.5855095,
          title: "<h3>:الزنغرية</h3> "+
	  "<p> الزنغرية قرية عربية من قرى قضاء صفد كانت تسمى “حلق”، ولعلها سميت كذلك من التزحلق لأنها تقوم على أرض منحدرة تتعرض للانزلاقات الأرضية، وتقع الزنغرية في شمال بحيرة طبرية إلى الجنوب الشرقي من صفد، وقد نشأت فوق الأقدام الجبلية لمرتفعات الجليل المطلة على وادي الأردن على ارتفاع 250م عن سطح البحر </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الجردات، السوالمة، اللايمة، العويسات، الجمعات، المجادمة، الدويعرين، ويتفرع منها مهاوش، عوض، ملدي محسن </p>",
       },
      {
       lat: 33.1533, lng: 35.598,
          title: "<h3>:الزاوِية</h3> "+
	  "<p> الزاوية قرية عربية تقع إلى الشمال الشرقي من مدينة صفد ، وأقرب القرى إليها المفتخرة والبويزية، وتمتد إلى الشمال منها طريق رئيسة تخترق أراضي سهل الحولة من خيام الوليد في الشرق إلى طريق طبرية - المطلة في الغرب، وترتبط الزوية بها بدرب ممهد، قامت القرية فوق أرض منبسطة من أراضي سهل الحولة ترتفع قرابة 75م عن سطح البحر </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> خليل، عقيل، الناطور، الجليل، النجار، مسوار، آل الاسدي </p>",
       },
      {
       lat: 33.2153, lng: 35.5997,
          title: "<h3>:الزوق التحتاني</h3> "+
	  "<p> الزوق التحتاني قرية فلسطينية تقع 30 كم شمال شرق مدينة صفد بالقرب من الحدود الفلسطينية - اللبنانية، وتقوم على وادي البريغيث في منتصف المسافة تقريباً بين الخالصة والخصاص، وأقرب القرى إليها لزازة، وتقع القرية إلى الجنوب قليلاً من طريق الخالصة - دان الرئيسة التي تتقاطع مع طريق طبرية  المطلة شمالي قرية الخالصة، وترتبط القرية أيضاً بقرية الخصاص بتلك الطرق، وتربطها بالزوق الفوقاني طريق ممهدة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> أبو علي، المصري، الخطيب، الجرايده، الفريحات، الهلالية، أبو رميض، العاصبة، الموسى، البدارنة، جردات، آل كليب، بشير، الحمادنة، العيشة، اليوسف، المصطفى، المحمود، خلف، الدحيل، دخل الله، عرب، الوخيم </p>",
       },
      {
       lat: 33.2239414, lng: 35.6437756,
          title: "<h3>:الزوق الفوقاني</h3> "+
	  "<p> الزوق الفوقاني قرية فلسطينية تقع 32 كم شمالي مدينة صفد، بالقرب من الحدود الفلسطينية – اللبنانية، وإلى الجنوب من منابع وادي البريغيث أحد روافد وادي الأردن الأعلى في أقصى شمالي القضاء، وتقع القرية عند ملتقى عدة طرق ثانوية إلى الجنوب من آبل القمح حيث تلتقي طريق قادمة من الزوق التحتاني وأخرى من السنبرية، وثالثة تربطها بالطريق الرئيسة الممندة بين طبرية والمطلة  </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> المواسي </p>",
       },
      {
       lat: 32.9579, lng: 35.4524,
          title: "<h3>:السموعي</h3> "+
	  "<p> السموعي قرية عربية تقع إلى الجنوب الغربي من مدينة صفد وتبعد قرابة خمسة كيلومترات إلى الشمال الشرقي من قرية فراضية في منتصف المسافة بينها وبين قرية ميرون، وعلى الطريق الرئيسة التي تصل صفد بعكا وتمر بقرى ميرون والسموعي وفراضية والرملة ومجد الكروم، وتنشر مضارب عرب الخرابنة في الجنوب الشرقي من القرية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> قدورة، يوسف، جابر، البنا، خليل، ظاهر، شواهنة، الصالح، عساكرة، الصعبي </p>",
       },
      {
       lat: 33.2349, lng: 35.6174,
          title: "<h3>:السنبرية</h3> "+
	  "<p> السنبرية قرية عربية تقع إلى الشمال الشرقي من مدينة صفد على الضفة الغربية لنهر الحاصباني قرب الحدود الفلسطينية – السورية – اللبنانية، وأقرب قرية إليها الخصائص، وقد ارتبطت القرية بقرية الزوق الفوقاني وخربة الميدان وجسر الغجر بطرق ممهدة، وارتبطت بقرى الخصاص ودفنة بطريق معبدة تصل بين كل من دان ودفنة والخصاص والخالصة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الذيب، غنيمة، بركات، جبارة </p>",
       },
      {
       lat: 33.2386, lng: 35.6359,
          title: "<h3>:الشوكة التحتا</h3> "+
	  "<p> تقع قرية الشوكة التحتا في أقصى الجهة الشمالية الشرقية لمدينة صفد، على ضفة نهر بانياس الغربية عند الحدود الفلسطينية – السورية، وهي إلى الجنوب الغربي من عين القاضي إلى تغذي نهر القاضي (دان)، وترتبط شوكة التحتا بقريتي دان ودفنة بطريقين ممهدتين، كذلك ترتبط بقرية السنبرية بطريق ممهدة تصل شوكة التحتا بطريق دان – الخالصة الرئيسة التي تتفرع منها طريق معبدة إلى السنبرية، بعد اجتيازها نهر الحاصباني، بجسر حديدي </p>",
       },
      {
       lat: 32.908, lng: 35.4866,
          title: "<h3>:الشونة</h3> "+
	  "<p> الشونة قرية عربية تقع جنوب مدينة صفد على وادي العمود، التي تقع عليه أيضاً قرى القديرية وسيرين، وقرية الشونة مركز تتفرع منه عدة دروب تصلها باقي القرى والخرب المجاورة، وتتبع هذه الدروب مجاري الأودية، ويربط أحدها الشونة بياقوق، وتنتشر مضارب عرب السياد وعرب القديرات إلى الشرق من القرية </p> <br>"+
	  "<p> أقيمت الشونة عند التقاء عند أودية شرعية تشكل معاً مجرى واحداً، هو مجرى وادي العمود، الذي ينحدر من مرتفعات صفد، ويصب في بحرية طبرية. وترتفع الشونة 50 م فوق سطح البحر، وتحيط بها التلال من مختلف الجهات باستثناء الجهة الجنوبية الغربية، وتحيط بها أراضي القديرية وياقوق وفراضية والظاهرية التحتا وخربة الحقاب </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> القرامرة، آل الشمالي </p>",
       },
      {
       lat: 33.1674, lng: 35.6116,
          title: "<h3>:الصالحية</h3> "+
	  "<p> الصالحية قرية عربية تقع إلى الشمال الشرقي من مدينة صفد، عند معتوق وادي طرعان من مجرى نهر الأردن، وفي منتصف المسافة بين قريتي الزوية والناعمة، وتربطها بقرى الناعمة والزوية والخالصة طرق صالحة للسيارات، كذلك تربط بطريق الخالصة والمفتخرة الرئيسة، وتصلها بخيكم الوليد طريق صالحة للسيارات، تجتاز نهر الأردن بعد افتراقه عن وادي طرعان </p>",
       },
      {
       lat: 32.999187, lng: 35.628443,
          title: "<h3>:الصيادة</h3> "+
	  "<p> الصيادة قرية تابعة لصفد </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الهرامشة، البلالية، المصاروة، البكادشة، هرموش، الجوايدة، الخوالدة، فياصلة، بلاوي، حميدة، خزاعي، الاسدي، عابد، عطايا، الحصالة، القيشاوي، عوض، هلال، الخطيب، المصاروة، حلاوة، القبلاوي، عزارة، الحمد، الشيخ </p>",
       },
      {
       lat: 32.9633, lng: 35.4869,
          title: "<h3>:الظاهرية التحتا</h3> "+
	  "<p> الظاهرية التحتا هي احدى القرى الفلسطينية التي دمرت بالكامل وطهرت عرقيا عام 1948، من قبل القوات الصهيونية في عمليه سميت 'يفتاح' على يد الكتيبة الاولى للبلماح (القوه الضاربه)، تقع القرية على منحدر يبعد 3 كيلومتر حنوب مدينه صفد، مواجهه جبل الجمرق، كانت القرية تقع في الحوض الذي يغذي الشطر الأعلى من وادي الليمون، وكانت تربطها طرق عده بصفد </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> آل زيد، الشاهين، الطروبة، آل سلامة، آل الحوبري، آل شحادة، الصالح، آل قشقوش، آل الشعبي، آل شعبان، الخطيب، طروية، نقله، ربيع </p>",
       },
      {
       lat: 32.9663689, lng: 35.4959708,
          title: "<h3>:الضاهريّة الفوقة</h3> "+
	  "<p> تقع الظاهرية الفوقة غربي مدينة صفد وتبلغ مساحة أراضيها 16304 دونماً، يسيطر عليها اليهود، وتحيط بها أراضي كل من عكبرة وخربة حقاب وصفد وجب يوسف وزحلق وروشينا والظاهرية التحتا وفي العهد العثماني كانت الظاهرية هذه قرية عامرة</p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> سلامة، الوزير، الرزاز، حلواني، الساعاتي، طيفوري، سويلم </p>",
       },
      {
       lat: 33.1079, lng: 35.6472,
          title: "<h3>:العريفية</h3> "+
	  "<p> احتلت قرية العريفية من قبل الاحتلال الصهيوني بتاريخ 1 نيسان، 1948، وكانت تبعد عن مركز المحافظة 21 كم شمال شرقي صفد، ويبلغ متوسط ارتفاعها عن سطح البحر 175 متراً </p>",
       },
      {
       lat: 33.1987, lng: 35.633,
          title: "<h3>:العابسية</h3> "+
	  "<p> العابسية، قرية فلسطينية تقع على بعد 16 كم إلى الشمال الشرقي من عكا، وقد أخليت من سكانها من قبل قوات الاحتلال الإسرائيلية خلال الفترة 1948، 1950 وظلت مهجورة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> البطانجة، المناصرة، الدلالشة، المصاروة، لافي ، عموري، كايد، موسس، حمزه، حسن، ذيب </p>",
       },
      {
       lat: 33.0731, lng: 35.5869,
          title: "<h3>:العلمانية</h3> "+
	  "<p> العلمانية قرية عربية، تقع في شمال شرق مدينة صفد، وتبعد عنها 23كم، منها 22كم طريق معبدة، وكيلومتر واحد غير معبد، أنشئت العلمانية في غور الجولة، على بعد نصف كيلومتر من شاطىء، بحيرة الجولة الغربي، وعلى ارتفاع 80م فوق سطح البحر، وتقع عين العلمانية قرب الطرف الجنوبي الشرقي للقرية، وعين أم حوران على بعد كيلومتر واحد غربها، الامتداد العام للقرية من الشمال إلى الجنوب، وكان فيها 100 مساكن عرب زبيد الواقعة في شمالها الغربي على بعد 1, 5كم، وفي عام 1945 بلغت مساحة القرية 9 دونمات </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> آل شمالي </p>",
       },
      {
       lat: 32.9316, lng: 35.4272,
          title: "<h3>:الفرّاضية</h3>"+
	  "<p> تقع الفراضية إلى الجنوب الغربي من صفد وتبعد عنها 10كم، قتل من سكانها 100 شخص عندما احتلها الصهاينة وشردوا أهله،ا واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 8700 دونم، وأقيمت على أراضيها مستوطنة (كيبوتس فارود) عام 1949م، عدد سكانها عام 1922م حوالي 362 نسمة وفي عام 1931م حوالي 465 نسمة ارتفع عام 1945م إلى 670 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> اشتيوي، رباح، السموعي، سارة، العلي، عابد، حسين، المشايخ، البدارنة، فرج، السوقي، عطور </p>",
       },
      {
       lat: 32.9045, lng: 35.5078,
          title: "<h3>:القديرية</h3>"+
	  "<p> تقع القديرية إلى الجنوب من صفد وتبعد عنها 18كم، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 12500 دونم، عدد سكانها عام 1922م حوالي 194 نسمة وفي عام 1931م انخفض إلى 72 نسمة ارتفع عام 1945م إلى 390 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> حليحل، أبو ناصر، الأسمر، شهاب، صنديد، فاعور، خلف، صالح، شرقي، الخطيب، خالد، منصور، مفلح، المعجل، فلاح، البدارنة، الحسن </p>",
       },
      {
       lat: 33.1046, lng: 35.5066,
          title: "<h3>:المالكية</h3>"+
	  "<p> ألحقت المالكية بفلسطين عام 1922م، تقع إلى الشمال من صفد وتبعد عنها 36، 5كم، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 7300 دونم، وأقيمت على أراضيها مستوطنة (كيبوتس مالكية) عام 1949م، عدد سكانها عام 1931م حوالي 245 نسمة ارتفع عام 1945م إلى 360 نسمة </p>",
       },
      {
       lat: 33.1579, lng: 35.6387,
          title: "<h3>:المفتخرة</h3>"+
	  "<p> تقع المفتخرة إلى الشمال الشرقي من صفد وتبعد الحدود السورية 3 كم عنها، استولت سلطات الاحتلال على أراضيها البالغة مساحتها 5600 دونم، عدد سكانها عام 1931م حوالي 231 نسمة ارتفع عام 1945م إلى 350 نسمة بما فيهم سكان ابريجات </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> تميم، عمايرة، جلبوط، كوسا، المصارو، الخطايبة، السوالمة، عرب الصويلات </p>",
       },
       {
       lat: 33.15988134220655, lng: 35.564292831865274,
          title: "<h3>:الميس </h3> "+
	  "<p> الميس من قرى صفد، الجليل من فلسطين الانتداب، متاخمة للحدود اللبنانية، وكانت ثاني أكبر القرى في قضاء صفد، إلا أن سكانها هجروا في 1948، وينادي بعض اللبنانيون بأنها قرية لبنانية جنوبية ضمن ما يعرف بالقرى السبع من حدودها بلدة المنارة التي كانت ملكاً لآل الاسعد وآل الأمين وبعض أهالي ميس الجبل وهي بلدة صغيرة تقع على تلة مقابلة لبلدة حولا وتتصل بالبلد المذكورة من خلال تلة العباد، أما وجد بها آبار وثغور في الجبال مما يدل على انها كانت مسكونة </p>",
       },
      {
       lat: 33.105709, lng: 35.554020,
          title: "<h3>:النبي يوشع</h3>"+
	  "<p> تقع قرية النبي يوشع إلى الشمال الشرقي من صفد وتبعد عنها 31 كم شرد أهلها، وسلبت أراضيها ومساحتها 3600 دونم، بلغ عدد سكانها عام 1931م حوالي 52 ارتفع إلى 70 نسمة عام 1945م </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الغول، العلي، الرحال ،هزاوي، عرب الحمدون، بلاوني </p>",
       },
      {
       lat: 33.1882, lng: 35.595,
          title: "<h3>:الناعمة</h3>"+
	  "<p> تقع الناعمة إلى الشمال الشرقي من مدينة صفد، وتبعد عنها 21 كم، وبالقرب من الحدود اللبنانية، تبلغ مساحة اراضيها (7155) دونماً، تحيط بها أراضي قرى الصالحية وقيطة والزوية والخالصة والزوق التحتاني والحولة، وقدر عدد سكانها عام 1931 حوالي (858) نسمة، وفي عام 1945 حوالي (1030) نسمة، تحيط بالقرية خربة تل الناعمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> العيسة، الخزارية، الداوابدية، الطنابرة، المصاروة، دحبوش، العلي، مشيرفة، خضر، الحجاج </p>",
       },
      {
       lat: 33.0565924, lng: 35.6080385,
          title: "<h3>:الويزية</h3>"+
	  "<p> الويزية قرية فلسطينية تبعد 8, 5 كيلومتر شمال شرق مدينة صفد، تقع القرية على امتداد نهر الأردن بين بحيرة طبرية والحولة، يمر منها وادي المشيرفة من الجنوب، ووادي أبو الحيات من جنوبها، أما في الشمال فيمر منها وادي الحج أيوب، يبلغ ارتفاع القرية 240 م عن سطح البحر، تعود تسمية القرية لهذا الاسم نسبة للشيخ ويزي حيث يقع قبره على بعد نصف كم عن شمالي شرق خرائب الويزية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عرب الغوارنة </p>",
       },
      {
       lat: 33.103064, lng: 35.578225,
          title: "<h3>:بيسمون</h3>"+
	  "<p> قرية بيسمون عربية تقع في سهل الحولة في الشمال الشرقي من مدينة صفد على حافة مستنقعات الحولة الغربية، وفي ظاهر قرية الملاحة الشمالي، وعلى بعد 3 كم إلى الجنوب من قرية جاحولا، تمر إلى الغرب منها طريق طبريا ، المطلة التي تتفرع منها طريق ثانوية غير معبدة إلى الشمال من قرية عرب زبيد، وتمر بقرية الملاحة ثم بيسمون لتعود وتلتقي مرة أخرى بالطريق الرئيسة المذكورة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عرب الحمدون </p>",
       },
       {
       lat: 32.979699673509444, lng: 35.49759946279064,
          title: "<h3>:بيريّا </h3> "+
	  "<p> بيريا كانت قرية فلسطينية تبعد 1, 5 كيلومتر شمال شرق مدينة صفد </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> السيد، رضوان، فرحان، شعبان، شعباني </p>",
       },
       {
       lat: 33.053113418830655, lng: 35.62817933177167,
          title: "<h3>:تليل </h3> "+
	  "<p> تليل قرية فلسطينية تبعد 14, 5 كيلومتر شمال شرق مدينة صفد </p>",
       },
       {
       lat: 33.12489885771909, lng: 35.56719933177746,
          title: "<h3>:جاحولا </h3> "+
	  "<p> جاحولا قرية فلسطينية تبعد 11 كيلومتر شمال شرق مدينة صفد، عند أسافل جبال الجليل وتطل على سهل الحولة من جهة الغرب، امتدت قرية جاحولا في اتجاه شمالي غربي، وقد كانت توازي طريق المطلة، طبريا العام </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> شعبان، احمد، حمد، هالد، عطية، العيادة، الجمعة، عمار </p>",
       },
      {
       lat: 32.919, lng: 35.5365,
          title: "<h3>:جُب يوسف </h3> "+
	  "<p> جب يوسف قرية عربية تقع جنوبي شرق صفد على مسافة قريبة من الشاطيء الشمالي الغربي لبحيرة طبرية، موقعها الجغرافي ذو أهمية كبيرة لوقوعها على طريق عكا – دمشق، وكان موقعها يعرف باسم 'خان جب يوسف' في القديم لأنها كانت إحدى المحطات الواقعة على طريق دمشق </p>"+
	  "<br><p> نشأت القرية قرب بئر للمياه تدعى جب يوسف، فوق رقعة من الأرض منبسطة نسبياً، ولا يزيد ارتفاعها على 240م فوق سطح البحر، وكانت تشرف على سهل الطابعة الذي تخترقه مجموعة أودية في طريقها إلى بحيرة طبرية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عرب السيدي، بني نمير، مهنا، الاسعد </p>",
       },
      {
       lat: 33.0230188, lng: 35.3657581,
          title: "<h3>:حُرفيش </h3> "+
	  "<p> حرفيش هي بلدة عربية في منطقة الجليل وهي سلطة محلية اعترف بها كسلطة محلية عام 1967، معظم سكانها من الدروز إلى جانب أقلية مسيحية </p>",
       },
      {
       lat: 32.9779, lng: 35.5876,
          title: "<h3>:خربة المُنظار </h3> "+
	  "<p> تقع قرية خربة العزيزات في شمال شرق مدينة صفد، وتبعد عنها 51 كم، منها 47 كم طريق معبدة، و4 كم غير معبدة، وتمر الحدود الفلسطينية - السورية في شرقها مباشرة </p> <br>"+
	  " <p> تقوم القرية على خربة على تل في بداية هضبة الجولان، على ارتفاع 389 فوق سطح البحر، وتمتد أراضيها بين الحدود الفلسطينية - السورية في الشرق ونهر بانياس في الغرب، ويخترقها أحد روافد نهر بانياس </p>",
       },
      {
       lat: 32.9111, lng: 35.5628,
          title: "<h3>:خربة كرّازة </h3> "+
	  "<p> خربة كرازة قرية فلسطينية تبعد 8، 5 كيلومتر جنوب شرق مدينة صفد، يبلغ متوسط 6 ارتفاعها عن سطح البحر 50 متر، احتلت قرية خربة كرازة من قبل الاحتلال الصهيوني بتاريخ 4 أيار 1948، حيث قامت عملية عسكرية ضد أهالي القرية بقيادة يفتاح والكتيبة المنفذة للعملية العسكرية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عرب الزنغرية، عرب السوالمة </p>",
       },
      {
       lat: 33.2395, lng: 35.6718,
          title: "<h3>:خان الدوير </h3> "+
	  "<p> خان الدوير(بالانجليزية Duwayen ،Khan al) كانت قرية فلسطينية في قضاء صفد، تبعد 35 كيلومتر شمال شرق مدينة صفد، وتقع على ارتفاع 200 متر عن سطح البحر، وقد نشأت على نهر العسل، أحد روافد نهر بانياس، يميز القرية أنها كانت محطّ رحال القوافل التجارية المسافرة بين سورية وفلسطين ولبنان، في نهاية القرن التاسع عشر </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الخنافسة، واوي </p>",
       },
      {
       lat: 33.1436, lng: 35.6531,
          title: "<h3>:خيام الوليد </h3> "+
	  "<p> خيام الوليد هي قرية فلسطينيّة مهجّرة منذ العام 1948، تبعد القرية عن مركز محافظة صفد 25 كم من الجهة الشمالية الشرقية، يبلغ متوسط ارتفاعها عن سطح البحر 150متر </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> ابراهيم، درباشية، الكرمي، الياسين، الهلال، مهند، زيادة، فرید، حسن علي، بوزو، ازريق </p>",
       },
      {
       lat: 33.0223, lng: 35.498,
          title: "<h3>:دلاّتة </h3> "+
	  "<p> دلاتة قرية عربية تقع شمالي صفد في منتصف الطريق بين قريتي ماروس وطيطبا </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> معي، عبد الله، أبو السمن، سويد </p>",
       },
      {
       lat: 33.0795, lng: 35.5059,
          title: "<h3>:ديشوم </h3> "+
	  "<p> ديشوم قرية عربية تقع على بعد نحو 14 كم شمالي مدينة صفد قريباً من الحدود اللبنانية، وترتبط بكل من صفد والقرى العربية المجاورة بطرق ثانوية، نشأت دبلوم فوق الحافة الشمالية لوادي الحنداح على ارتفاع 600 م عن سطح البحر </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الحلاق، المغربي، راضي، الحتاملة، اسبيعيني </p>",
       },
      {
       lat: 33.0464564, lng: 35.4936841,
          title: "<h3>:ريحانية</h3> "+
	  "<p> الريحانية هي قريه شركسية في الجليل الأعلى في شمال فلسطين، تبعد 8 كم من البلد صفد، إدارياً ينتمي القريه إلى المجلس الإقليمي ميروم الجليل، أغلب سكان البلد تكون من قبيله الابزاخ، وتبلغ عدد السكان تقريبا إلى 1100 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> آل السعيد، صبح، أبو درة، حميدة، أبو الناجي، أبو زبيبة، أبو سالم، أبو شعبان، صبح، استيتة، الشركسي </p>",
       },
      {
       lat: 33.0113, lng: 35.3407,
          title: "<h3>:سبلان</h3> "+
	  "<p> سيلان قرية عربية تقع إلى الشمال الغربي من مدينة صفد ، وتبعد ثلاثة كيلومترات جنوبي طريق صفد – ترشيحا، ويربطها بتلك الطريق درب ترابي، وتصلها دروب أخرى بالقرى المجاورة مثل حرفيش وسحماتا، وإلى الجنوب من القرية تقع أراضي عرب المريدات </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> فاعور، الحريري، مبدي </p>",
       },
       {
       lat: 33.0285, lng: 35.3938,
          title: "<h3>:سَعْسَعْ </h3> "+
	  "<p> سعسع  كانت قرية فلسطينية تبعد 31 كم شمال شرق مدينة صفد و 4 كم من الحدود مع لبنان، تقع على قمة جبل بارتفاع 875 م فوق سطح البحر، ويقابلها جبل الجرمق من الجنوب </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> آل السعيد، وهبة، السيد، الحاج أحمد ناصر ، الحاج أبو حسان، ظريفة، قاسم، زیدان، حسين، خليل، أبو الشباب، الحسينية، طاهر، رابح </p>",
       },
      {
       lat: 33.0112, lng: 35.4452,
          title: "<h3>:صفصاف</h3> "+
	  "<p> صفصاف قرية عربية إلى الشمال الغربي من مدينة صفد، وعلى بعد كيلومترين إلى الجنوب من قرية الجيش، كانت تدعى في العهد الروماني باسم صفصافة، وزارها العالم الأمريكي روبنصون في القرن قبل ماضي، ووصفها بأنها مزرعة صغيرة في القسم الجنوبي من سهل الجش، تكثر فيها أشجار الزيتون والفاكهة </p> <br>"+
	  "<p> أقيمت الصفصاف إلى الشمال الشرقي من جبل الجرمق (284 م) على خط تقسيم المياه بين الأودية المتجهة نحو سهل الحولة والأودية المتجهة نحو بحيرة طبرية، وامتدت القرية بشكل طولي جنوبي غربي شمالي شرقي، على الجانب الشرقي لطريق صفد - ترشيحا الرئيسة، </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الحقب، دهشة، حسنة، زيدان، ایوب، حمد، عزام، دكور، مجدوب، العیسی، کاید، شریده، صالح، الدغيم، زغموت، أبو جدبة، يونس </p>",
       },
      {
       lat: 33.0764654, lng: 35.4503353,
          title: "<h3>:صَلْحَة</h3> "+
	  "<p> صلحة قرية عربية تقع شمال الشمال الغربي لصفد، بالقرب من الحدود اللبنانية، وهي على يمين الطريق الرئيسة بين صفد وهذه الحدود، وتربطها بهذه الطريق وصلة فرعية لطريق ثانوية، نشأت صلحة فوق رقعة من الأرض ترتفع نحو 500 م عن سطح البحر، ويمر بالقرب منها وادي صلحة، الذي يحتوي على آثار تعود إلى عصور ما قبل التاريخ </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> خليل، قعد، مصطفی، طالب، مداح، یونس، بلاري، جارور، المصري </p>",
       },
      {
       lat: 33.013, lng: 35.4757,
          title: "<h3>:طيطبا</h3> "+
	  "<p> طيطبا كانت قرية فلسطينية في قضاء صفد، تقع على بعد 5 كيلومتر شمال صفد، قامت العصابات الصهيونية المسلحة بهدم القرية وتشريد أهلها البالغ عددهم عام 1948، 615 نسمة وكان ذلك في 1 مايو 1948 وبلغ مجموع اللاجئين من هذه القرية في عام 1998 حوالي 3776 نسمة، وكانت تبعد عن مدينة صفد 10 كم، وترتفع 800 م عن سطح البحر، بلغت مساحة أراضيها حوالي 8453 دونماً، أحاطت بها أراضي قرى دلاتة والرأس الأحمر والجش والريحانية وقديتا وعموقة وقدر </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> شناعه، الرفاعية، قاسم ، شحادة، بليبل، طه، عبدو، علي، يعقوب، حسنة، سعده، سعد، سعادة، زيدان، خليل، الحسن، السعدي، دهشة، خصر، حليحل </p>",
       },
      {
       lat: 32.9648548, lng: 35.5855095,
          title: "<h3>:طوبا أو عرب الهيب</h3> "+
	  "<p> طوبا أو عرب الهيب: الحسني والخير والغبطة، وجاء في القرآن الكريم : (طوبى لهم)، وأما الطوب فهو الآجر وهي لغة مصرية قديمة معظم سكان هذه القرية من العرب البدو وتم تطهيرهم عرقيا ولكن بعضهم لايزال في القسم المغتصب يعيشون في قرية جوار قريتهم المدمرة تدعى بطوبي زنغرية وتعد القرية ذات موقع أثري يحتوي على أساسات من حجارة مقطوعة وعمود ونواويس، بالاضافة إلى خربة الشورى في الشمال الغربي وتحتوي على جدران وأسس وحجارة منحوتة وخزان ونواويس وأعمدة نبذة تاريخية وجغرافية موقع أثري غرب نهر الأردن وإلى الشمال الشرقي من مدينة صفد، وترتفع 200 م عن سطح البحر، تبلغ مساحة أراضيها (15992) دونماً، تحيط بها أراضي قرى منصورة الخيط وعرب الشمالنة وزحلق، قدر عدد سكانها عام 1922 حوالي (175) نسمة، وفي عام 1945 حوالي (590) نسمة وهم جميعاً ينتمون إلى عرب الهيب </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> حميدي، عواد، السعايدة، الخزاعلة، ذياب، العوض، عقلة، حتاملة </p>",
       },
      {
       lat: 32.9037, lng: 35.6022,
          title: "<h3>:عرب الشمالنة</h3> "+
	  "<p> عرب الشمالنة المعروفة باسم خربة أبو زينة هي قرية عربية فلسطينية في قضاء صفد، وقد تم تهجير سكانها خلال حرب التطهير العرقي لفلسطين الانتدابية 1947 إلى 1948 في 4 مايو 1948 في إطار عملية ماتاتي (المكنسة)، وهي عملية فرعية لعملية يفتاح، تقع على مسافة 13 كيلومتراً جنوب شرق صفد بالقرب من نهر الأردن </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الخطيب، الميس، خشان، شرقي، معتوق، سعید، صالح، عیاش، المواسي، الهيب، زبید </p>",
       },
      {
       lat: 33.079, lng: 35.5675,
          title: "<h3>:عرب الزبيد</h3> "+
	  "<p> عرب الزبيد قرية فلسطينية تبعد 15 كيلومتراً شمال شرق مدينة صفد، كل سكانها كانوا من المسلمين وهم من قبيلة بني الزبيد، زراعة الحبوب كانت عماد اقتصادها </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عرب الزبيد </p>",
       },
      {
       lat: 32.9405317, lng: 35.5094208,
          title: "<h3>:عكبرة</h3> "+
	  "<p> القرية عكبرة تنتشر على طرفي واد عميق يمتد من الشمال إلى الجنوب، ويمر وسط منحدر يواجه الجنوب، وكان ثمة، بعد الوادي، تل يواجه القرية، وكانت طريق ترابية تصل عكبرة بمدينة صفد المجاورة، وكان هناك، على الجنوب الشرقي من القرية، خربة العقيبة التي يعد موقعها </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الميعاري، صالح، فياض، آل عامش </p>",
       },
      {
       lat: 33.0556, lng: 35.491,
          title: "<h3>:علما</h3> "+
	  "<p> علما قرية عربية تبعد 4 كم جنوب الحدود الفلسطينية – اللبنانية، ودفع شمال مدينة صفد، على بعد 13 كم عن طريق طيطيا – الرأس الأحمر – الريحانية، من هذه المسافة 3 كم طريق معبدة، و 10 كم غير معبدة، وتبعد عن طريق قرية الجش 15كم، منها 9 كم طريق معبدة و6 كم غير معبدة </p> <br>"+
	  "<p> أنشئت علما في القسم الشمالي من جبال الجليل الأعلى (القسم الجنوبي من جبل عامل) في منطقة منبسطة على ارتفاع 680 م عن سطح البحر، ويقع جبل علول شمالها، ويرتفع 729م على بعد كيلومتر واحد، أما يقع جبل ريحان غربها ويرتفع 709م على بعد كيلومتر واحد، ويبدأ وادي الحمام على بعد نصف كيلومتر من شمالها الغربي، وهو رافد لوادي عبة، الذي يمر في شمالها الغربي وشمالها على بعد كيلومترين، وهو نفسه وادي الحنداج الذي كان يصب في الجزء الجنوبي الغربي من بحيرة الحولة، وتوجد بركة ماء في شرق القرية مباشرة، وصهريج في طرفها الجنوبي الغربي، وآخر في جنوبها </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> علما، ابراهيم، أبو شحادة، أبو الهيجا، ليلى، بكري، البيروتي، حجازي، حريري، حشمة، حليحل، الحاج خليل، دخل الله، دعيبس، رفاعي، سليمان، سيف، شراري، الشوباني، الشايب، صالح، عباس، عبد الخالق، عبد الرحمن، عبدي، حجاوي، حزكم، عطية، عقل، غنام، فاعور، قاسم، مكية، مرعي ، ماروني، ميداني، نصار، حجاج، شحرور، الجوي، الهجاج، سيف، عزام، عجاوي، نابلسي </p>",
       },
      {
       lat: 32.9980294, lng: 35.5204301,
          title: "<h3>:عموقة</h3> "+
	  "<p> عموقة قرية عربية تقع في شمال شرق مدينة صفد، وتبعد عنها 6 كم، منها 1 كم طريق معبدة، أنشئت عموقة في جبال الجليل الأعلى على ارتفاع 470 م فوق سطح البحر، في مكان تحيط به الجبال من كل الجهات، فيما عدا الجهة الشمالية، حيث يتجه مجرى الوادي الصغير الذي تقع القرية على ضفته الشرقية، ويرفد هذا الوادي وادي الوعر ، الذي يمر على بعد نصف كيلومتر، شمال القرية، ووادي الوعر هذا رافد لوادي وقاص الذي يصب في الطرف الجنوبي الغربي لبحيرة الحولة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الصالح، الكابر اقدم العائلات في عموقة هي عائلة عويد واكبرها هم الحمايدة آل حمدان ويليهم المصالحة آل مصلح ويتفرع من الحمايدة آل أبو جاموس، آل الصالح، آل طحيبش، آل عبد الوهاب، آل الحيش، آل الجشي، ويتفرع من المصالحة : آل عبد الرازق، آل الخطيب، آل داوود، آل مصطفى آل العلي، آل ياسين آل إبراهيم وآل ديب، أما ان هناك عائلات واحدة تحمل أسماء مختلفة وهي: آل رزوق وآل الشامي هم آل رزوق، ويتفرع من آل عبد السلام: آل الناطور، آل النجار، آل عابد وآل موسى، وآل إسماعيل، آل سليمان وآل سرحان هم عائلة واحدة ويتفرع من آل الحسن : آل صالح الحسن آل مرعي الحسن، وآل الظريف، آل عبد اللطيف وآل طه هم عائلة واحدة، آل عبد الرحيم وآل صبح هم عائلة واحدة، آل سعيد وآل اغا هم عائلة واحدة، آل عبد الحميد وآل احمد هم عائلة واحدة، وهناك عائلات اخرى: آل مجذوب، آل عثمان، آل ديراوي، آل عبد العزيز، آل شرقية، آل غنام، آل نوباني، آل عبد الهادي (الجمل)، آل عبد العال، آل واكد، آل جمعة، آل شحادة (السعسعاني)، آل خليل، آل حمدان، آل جابر، رحال، قاسم </p>",
       },
      {
       lat: 32.995377, lng: 35.508271,
          title: "<h3>:عين الزيتون</h3> "+
	  "<p> عين الزيتون قرية عربية من قرى قضاء صفد كانت تسمى 'زحلق'، ولعلها سميت كذلك من التزحلق لأنها تقوم على أرض منحدرة تتعرض للانزلاقات الأرضية، وتقع الزنغرية في شمال بحيرة طبرية إلى الجنوب الشرقي من صفد، وقد نشأت فوق الأقدام الجبلية لمرتفعات الجليل المطلة على وادي الأردن على ارتفاع 250م عن سطح البحر </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> خطاب، الرفاعي، عصمان، الحجار، حميد، ادريس، عبدالفتاح، البواب، لافي، الكردي، القط، عمقاطة، ادريس </p>",
       },
      {
       lat: 33.0143, lng: 35.3759,
          title: "<h3>:غبّاطية</h3>"+
	  "<p> غباطية قرية تابعة لقضاء صفد </p>",
       },
      {
       lat: 33.1212, lng: 35.6458,
          title: "<h3>:غرابة</h3>"+
	  "<p> غرابة قرية عربية تقع شمال شرق مدينة صفد، وتبعد عنها 54 كم عن طريق الخالصة، منها 42, 5 كم طريق معبدة، و 11, 5 كم غير معبدة، وتبعد نحو نصف كيلومتر غرب الحدود الفلسطينية – السورية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> المغربي، شباطة، عميش، الفضلي، رحا، قاسم </p>",
       },
      {
       lat: 33.0652, lng: 35.4565,
          title: "<h3>:فارة</h3>"+
	  "<p> تقع فارة إلى الشمال الغربي من صفد وتبعد عنها 13كم، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 7200 دونم، عدد سكانها عام 1922م حوالي 217 نسمة وفي عام 1931م حوالي 229 نسمة ارتفع عام 1945م إلى 320 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الحاج، مرمر، يوسف، اشتيوي، حمدان، مرعي </p>",
       },
      {
       lat: 32.9853, lng: 35.5326,
          title: "<h3>:فرعم</h3>"+
	  "<p> تقع فرعم إلى الشمال الشرقي من صفد وتبعد عنها 7 كم، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 2100 دونم، وأقيمت على أراضيها مستوطنة (هازو ها جليتيت)، عدد سكانها عام 1922م حوالي 499 نسمة وفي عام 1931م حوالي 527 نسمة ارتفع عام 1945م إلى 740 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عوده، عثمان، عبد الله، شعبان، كنعان، طافش، كمنة، فاعو، فرحات، عريشه، حميد، العكاوي، الكردي، حنو، دبدوب، صباح، أبو دية، الرفاعي، الأحمد، كريم، اشتيوي، اللحام، داوود، حمزه، الحمو، عزيمة، كساب، حنين، الشيخ، حبيب </p>",
       },
      {
       lat: 32.9991, lng: 35.5367,
          title: "<h3>:قبّاعة</h3>"+
	  "<p> تقع قباعة إلى الشمال الغربي من صفد وتبعد عنها 12كم، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 13800 دونم، عدد سكانها عام 1922م حوالي 179 نسمة وفي عام 1931م حوالي 256 نسمة ارتفع عام 1945م إلى 460 نسمة بما فيهم سكان (جزر الخنداج) ومقر الدروز </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> البكري، شحادة، الياسين، الحمدان، العلي، المصري، الشاويش، العيسى، كريم، المحاحي، ايوب، الرفاعي، الشواهين، آل الحجي </p>",
       },
      {
       lat: 33.1131, lng: 35.527,
          title: "<h3>:قدس</h3>"+
	  "<p> قدس تقع في جبال الجليل الأعلى على ارتفاع 470 م عن سطح البحر في ناحية تبنين (لواء صفد)، على كتف جبل يبرز نحو الجنوب الشرقي، ويمر وادي الغصون بشمالها وشمالها الشرقي على بعد كيلومتر واحد وينتهي في مستنقعات شمالي الحولة، الامتداد العام للقرية من الشمال الغربي إلى الجنوب الشرقي، وهي من النوع المكتظ، وكان فيها 56 مسكناً في عام 1931، وفي عام 1945 بلغت مساحة القرية 20 دونماً ومساحة أراضيها 14139، يحيط به أراضي قرى البويزية وجاحولا والنبي يوشع والهراوي وديشوم والمالكية والأراضي اللبنانية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> آل شراري </p>",
       },
      {
       lat: 33.0045, lng: 35.4671,
          title: "<h3>:قدّيتا</h3>"+
	  "<p> تقع قديتا إلى الشمال الغربي من صفد وتبعد عنها 7 كم، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 2400 دونم، عدد سكانها عام 1922م حوالي 110 نسمة وفي عام 1931م حوالي 170 نسمة ارتفع عام 1945م إلى 240 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> حليحل، حمزة </p>",
       },
      {
       lat: 33.218067, lng: 35.618300,
          title: "<h3>:قيطية</h3>"+
	  "<p> تقع قيطية إلى الشمال الشرقي من صفد وتبعد عنها 29 كم، هدمت القرية عام 1951م، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 2100 دونم، عدد سكانها عام 1931م حوالي 245 نسمة ارتفع عام 1945م إلى 360 نسمة </p>",
       },
      {
       lat: 33.017942, lng: 35.607682,
          title: "<h3>:كراد البقّارة</h3>"+
	  "<p> تقع كراد البقارة إلى الشمال الشرقي من صفد وتبعد عنها 10كم، هدمت القرية عام 1951م، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 2, 1 ألف دونم، عدد سكانها عام 1931م حوالي 245 نسمة ارتفع عام 1945م إلى 360 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> البرازي، كعوش، أبو الريش، الرفاعي، غنامة، حجاج، حميد، عرب البلاونة، خلف </p>",
       },
      {
       lat: 33.018056, lng: 35.617222,
          title: "<h3>:كراد الغنامة</h3>"+
	  "<p> تقع كراد الغنامة إلى الشمال الشرقي من صفد وتبعد عنها 9 كم، هدمت القرية عام 1951م، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 3800 دونم، وأقيمت على أراضيها مستوطنة (عيليت هاشامار)، عدد سكانها عام 1931م حوالي 265 نسمة ارتفع عام 1945م إلى 350 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> اقطيش، اعمر، یونس، عليان، الحاج، القدري، البقاعي، بركه، سحلول، الاحمد، النمر، حجاج، الهوشي، المحاجبة، الخطبان، العجاج، الخطيب، اشتيوي، سعيد، حسين، النوسى، المحمود، العيسى، العلي، العبود، الخميس، العصمان </p>",
       },
      {
       lat: 33.206, lng: 35.6114,
          title: "<h3>:لزّازة</h3>"+
	  "<p> تقع لزازة في أقصى شمال فلسطين على نهر حاصبيا وإلى الشمال الشرقي من صفد، بلغت المساحة المسلوبة من أراضيها حوالي 644 دونم وعدد سكانها عام 1931م حوالي 176 نسمة وعام 1945م حوالي 230 مقام على أراضيها مستوطنة (موشاف بيت هيليل) عام 1940 </p>",
       },
      {
       lat: 33.0288, lng: 35.5279,
          title: "<h3>:ماروس</h3>"+
	  "<p> أنشئت ماروس في جبال الجليل الأعلى قرب قمة جبلية ترتفع 450م عن سطح البحر، يحيطها من الجهات الأربع: من شرقيها يقع جبل المخبة (ارتفاعه 443) على بعد قرابة كيلومتر واحد، ومن شمالها يمر وادي قديرة على بعد 250م، ومن جنوبها الغربي يمر وادي الشببيك على بعد نصف كيلومتر، أما من جنوب القرية فتقع عين البيضا على بعد 750م، الامتداد العام للقرية من الشمال إلى الجنوب، وكان فيها 12 مسكنا في عام 1931، وفي عام 1945 بلغت مساحة القرية 8 دونمات، وتم اعتبارها أنها ثالث أصغر قرية في قضاء صفد </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> نیرب، سلطان ،عزبي، حسين، صالحة، عساكرة، الصعبي </p>",
       },
      {
       lat: 33.205, lng: 35.6417,
          title: "<h3>:مداحل</h3>"+
	  "<p> كانت مداحل تنهض على رقعة مستوية من الأرض في الطرف الشمالي الشرقي لسهل الحولة، وتبعد نحو كيلومتر إلى الشرق من وادي بانياس، وكانت تبعد أقل من كيلومتر إلى الجنوب من تل الترمس </p>",
       },
      {
       lat: 33.0904, lng: 35.582,
          title: "<h3>:ملاّحة</h3>"+
	  "<p> تقع ملاحة إلى الشمال الشرقي من صفد وتبعد عنها 25 كم، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 1900 دونم، وأقيمت على أراضيها مستوطنة (موشاف سدى لبعيز) عام 1952م، عدد سكانها عام 1922م حوالي 697 نسمة وفي عام 1931م حوالي 654 نسمة انخفض عدد سكانها لأن سكان قبيلة زبيد من هذه القرية ضموا إلى سكان قرية العلمانية وفي عام 1945م بلغ عدد سكان القرية 980 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عرب الزبيد </p>",
       },
      {
       lat: 32.9717, lng: 35.6153,
          title: "<h3>:منصورة الخيط</h3>"+
	  "<p> تقع منصورة الخيط إلى الشرق من صفد وتبعد عنها 10كم، هدمت القرية وشرد أهلها، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 6700 دونم، وأقيمت على أراضيها مستوطنة (كيبوتس كفار هناسي) عام 1948م، عدد سكانها عام 1922م حوالي 437 نسمة وفي عام 1931م حوالي 267 نسمة انخفض عام 1945م إلى 200 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عطيه، منصور، أبو خزاعي، الواح، صلالحة، الدبور، ضلامحة، حمود </p>",
       },
      {
       lat: 32.9883, lng: 35.5387,
          title: "<h3>:مُغر الخيط</h3>"+
	  "<p> تقع مغر الخيط إلى الشمال الشرقي من صفد وتبعد عنها 15كم، هدمت القرية وشرد أهلها عام 1948م، واستولت سلطات الاحتلال على أراضيها البالغة مساحتها 6200 دونم، عدد سكانها عام 1922م حوالي 235 نسمة وفي عام 1931م حوالي 343 نسمة ارتفع عام 1945م إلى 940 نسمة </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عطية، منصور، حمزة، أبو خزاعي ،صلالحة، شاهين، الحلبي، الواح، الزيدان، الدبور، قبلان، آل سلامة، دراج، أبو عبيد، البقاعي، الحاج، الشياطي، طرشخاني، بركة، عليان، الرفاعي، طافش، خطیب، حمود، القادري، عمر </p>",
       },
      {
       lat: 32.9879437, lng: 35.4476967,
          title: "<h3>:ميرون</h3>"+
	  "<p> تقع ميرون إلى الجنوب الغربي من صفد وتبعد عنها 10كم شرد أهلها، وسلبت أراضيها ومساحتها 950 دونم، أقيم على أراضيها المسلوبة مستوطنة (موشاف ميرون) عام 1949م، بلغ عدد سكانها عام 1922م حوالي 154 نسمة وعام 1931م حوالي 189 نسمة ارتفع إلى 290 نسمة عام 1945م </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> آل كعوش </p>",
       },
      {
       lat: 33.218, lng: 35.5437,
          title: "<h3>:هونين</h3>"+
	  "<p> تقع هونين إلى الشمال من صفد وتبعد عنها 42 كم، ضمت إلى فلسطين عام 1922م، شرد أهلها، وسلبت أراضيها ومساحتها 13700 دونم، أقيم على أراضيها المسلوبة مستوطنة (موشاف مارجاليوت) عام 1951م، بلغ عدد سكانها عام 1931م حوالي 1075 ارتفع إلى 1620 نسمة عام 1945م بما فيهم سكان قريتي الحولة والعدسية </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> نابلسي، شحرور، حدروج، شاعر، برقاوي، قليط، منصور، حسون، طهماز </p>",
       },
       {
       lat: 33.0569092, lng: 35.5810442,
          title: "<h3>:جزاير الهنداج </h3> "+
	  "<p> جزاير الهنداج تقع في قضاء صفد </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> آل موسی، راضي، ياسين، حمود </p>",
       },
       {
          lat: 33.2599914, lng: 35.5797804,
          title: "<h3> أم عجرة </h3> ",
       },

//Not in Safed
/*
      {
       lat: 32.9399, lng: 35.5864,
          title: "<h3>:زُحلق/الزنفرية</h3> "+
	  "<p> زحلق أو الزنفرية قرية عربية من قرى قضاء صفد كانت تسمى “حلق”، ولعلها سميت كذلك من التزحلق لأنها تقوم على أرض منحدرة تتعرض للانزلاقات الأرضية، وتقع الزنغرية في شمال بحيرة طبرية إلى الجنوب الشرقي من صفد، وقد نشأت فوق الأقدام الجبلية لمرتفعات الجليل المطلة على وادي الأردن على ارتفاع 250م عن سطح البحر </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> الزمهريه، العويسات، السوالمة، الجردات، جروان، الجمعات، مجادمة، مبدي، اللكمية، الجبسي، كرازيه، حمدان ،جواعنه، العلي، خميس، الحسن، ذياب الحمد، العوض، الموسى </p>",
       },
      {
       lat: 32.96597721508443, lng: 35.593204885160944,
          title: "<h3>:طوبا زنفرية</h3> "+
	  "<p> طوبا الزنغرية هي قرية عربية تقع شمال شرق طبريا، وهي مسماة نسبة لعشائر الزنغرية والهيب التي سكنت منطقة عين طوبا واستقرت في حدود 1903 </p>"+
	  "<pre><b>:عائلاتها</b></pre>"+
	  " <p> عیسی، صبيح، محسن </p>",
       },
      {
       lat: 33.2814463, lng: 35.8253957,
          title: "<h3>:غجر</h3>"+
	  "<p> قرية الغجر وهي البقية الباقية والأثر الوحيد الدَّال على التواجد العلوي في فلسطين نتيجة فتوى الإبادة الجماعية والاحتلال الإسرائيلي، وهي قرية من قرى الجولان المحتل سكانها من العلويين هاجروا من شمال سورية (حلب وريفها) إلى الشمال الشرقي من فلسطين هربا من مذابح السلطان سليم العثماني وبحثاً عن الأمان بين أخوانهم عَلَويّي هضبة الجولان، وهذا إن دَلَّ على شَيءٍ فَإِنَّهُ يَدَلُ وبشكل قاطع وجازمٌ ويُبرهن بقوة على قدم تواجد العلوية النصيرية في مدينة صفد وطبريا وهضبة الجولان </p>",
       },
*/
      


     

   ];



// Iterate through markerData
for (let i = 0; i < Safad_markerData.length; i++) {
    // Assigning the title property of each marker
    let SafadmarkerTitle = Safad_markerData[i].title;

    // Add CSS styles to the title
    SafadmarkerTitle = `<div style="max-width: 400px; padding: 0px; text-align: right;">${SafadmarkerTitle}</div>`;
    SafadmarkerTitle = SafadmarkerTitle.replace(/<p>(.*?)<\/p>/g, '<p style="font-size: 16px; margin-top: -8px; margin-bottom: 5px; text-indent: 28px; direction:rtl">$1</p>');
    SafadmarkerTitle = SafadmarkerTitle.replace(/<b>(.*?)<\/b>/g, '<b style="font-size: 15px; font-wight: bold;">$1</b>');
  


    // Update the title property of the marker
    Safad_markerData[i].title = SafadmarkerTitle;
}